joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
// Controle do botão de reset WiFi
unsigned long tempoPressionadoBotaoResetWifi = 0;
bool botaoResetWifiPressionado = false;

// ========== DECLARAÃ‡ÃƒO DAS FUNÃ‡Ã•ES ==========
String geraNumeroSerieDoMAC();
void processaComandosBluetooth();
void executaComandoBluetooth(String cmd, const char* origin);
void enviaStatusBluetooth();
void iniciaTimerMotor();
void paraTimerMotor();
void atualizaHorimetro();
void salvaHorimetro();
void carregaHorimetro();
void configuraWiFiManager();
void atualizaSupabase();
void verificacaoPeriodicaStatus();
void enviaHorimetroParaSupabase();
void registraCadeiraNoSupabase();
void verificaStatusCadeira();
void sincronizaNTP();
String getTimestamp();
void bipBloqueio();
void carregaPreferencias();
void executa_M1_bluetooth();
void contagem_tempo_incoder_virtual();
void Watch_Dog();
void monitora_tempo_rele();
void Button_Seg();
void iniciaCalibracaoSeNecessario();
void executaCalibracao();
void resetCalibracao();
void Button_geral();
void executa_vz();
void executa_vz_ini();
void executa_M1();
void executa_pt();
void AT_SEG();
void bip();
void enviarBLE(String msg);
void verificaBotaoResetWifi();
void resetaConfiguracoesWifi();
static void supabaseLogUsage(const char* action);
static void supabaseCreateMaintenanceRequestIfNeeded();
static void supabaseSaveMemoryPosition(int slot);
static bool supabaseLoadMemoryPositionFromDb(int slot);
static void loadMotorTravelPreferences();
static void saveMotorTravelPreferences(bool force);
static void sendMotorTravelToSupabaseIfNeeded();
static bool supabaseUpsertMotorTravel();
static bool mqttPublish(const String& topic, const String& payload, bool retain);
static void mqttTaskMain(void* pvParameters);
void publicaStatusMQTT();

extern int incoder_virtual_encosto_service;
extern int incoder_virtual_asento_service;
extern int incoder_virtual_perneira_service;
extern bool estado_r;
extern bool estado_sp;
extern bool estado_dp;
extern bool estado_sa;
extern bool estado_da;
extern bool estado_se;
extern bool estado_de;
extern bool estado_trend_sobe;
extern bool estado_trend_desce;
extern const int TREN_INT_DESCE;
extern const int INT_TREND_DESCE;

// ========== FUNÇÕES MQTT ==========
static bool mqttPublish(const String& topic, const String& payload, bool retain) {
  if (!mqttLockMs(20)) {
    Serial.println("[MQTT_TX] MUTEX_TIMEOUT");
    return false;
  }
  if (!mqttClient.connected()) {
    Serial.print("[MQTT_TX] OFFLINE topic=");
    Serial.println(topic);
    mqttUnlock();
    return false;
  }
  bool ok = mqttClient.publish(topic.c_str(), payload.c_str(), retain);
  mqttTxCount++;
  mqttLastTxMs = millis();
  Serial.print("[MQTT_TX] ");
  Serial.print(ok ? "OK " : "FAIL ");
  Serial.print("topic=");
  Serial.print(topic);
  Serial.print(" payload=");
  Serial.println(payload);
  mqttUnlock();
  return ok;
}

static bool mqttEnqueuePublish(const String& topic, const String& payload, bool retain) {
  if (!mqttTxQueue) {
    return false;
  }
  MqttTxItem item;
  memset(&item, 0, sizeof(item));
  strncpy(item.topic, topic.c_str(), sizeof(item.topic) - 1);
  strncpy(item.payload, payload.c_str(), sizeof(item.payload) - 1);
  item.retain = retain;
  return xQueueSend(mqttTxQueue, &item, 0) == pdTRUE;
}

static void otaLoadPreferences() {
  Preferences p;
  if (!p.begin("ota", true)) {
    return;
  }
  otaEnabled = p.getBool("enabled", false);
  otaManifestUrl = p.getString("manifest", "");
  otaIntervalSec = p.getUInt("interval", 21600);
  otaPendingVersion = p.getString("pending", "");
  p.end();
}

static void otaSavePreferences() {
  Preferences p;
  if (!p.begin("ota", false)) {
    return;
  }
  p.putBool("enabled", otaEnabled);
  p.putString("manifest", otaManifestUrl);
  p.putUInt("interval", otaIntervalSec);
  p.putString("pending", otaPendingVersion);
  p.end();
}

static int otaCompareVersions(const String& a, const String& b) {
  int ai[4] = {0, 0, 0, 0};
  int bi[4] = {0, 0, 0, 0};
  int ac = 0;
  int bc = 0;
  int last = 0;
  for (int i = 0; i <= a.length(); i++) {
    if (i == a.length() || a[i] == '.') {
      if (ac < 4) ai[ac++] = a.substring(last, i).toInt();
      last = i + 1;
    }
  }
  last = 0;
  for (int i = 0; i <= b.length(); i++) {
    if (i == b.length() || b[i] == '.') {
      if (bc < 4) bi[bc++] = b.substring(last, i).toInt();
      last = i + 1;
    }
  }
  for (int i = 0; i < 4; i++) {
    if (ai[i] < bi[i]) return -1;
    if (ai[i] > bi[i]) return 1;
  }
  return 0;
}

static bool otaParseManifestJson(const String& body, OtaInfo& out) {
  out.available = false;
  out.mandatory = false;
  out.version = "";
  out.url = "";
  out.md5 = "";
  out.size = 0;

  DynamicJsonDocument doc(3072);
  DeserializationError err = deserializeJson(doc, body);
  if (err) {
    return false;
  }

  JsonVariant root = doc.as<JsonVariant>();
  if (root.is<JsonArray>() && root.size() > 0) {
    root = root[0];
  }
  if (!root.is<JsonObject>()) {
    return false;
  }

  JsonObject obj = root.as<JsonObject>();
  if (obj.containsKey("update_available")) {
    out.available = obj["update_available"].as<bool>();
  }
  if (obj.containsKey("mandatory")) {
    out.mandatory = obj["mandatory"].as<bool>();
  }
  if (obj.containsKey("version")) {
    out.version = obj["version"].as<String>();
  }
  if (obj.containsKey("url")) {
    out.url = obj["url"].as<String>();
  }
  if (obj.containsKey("md5")) {
    out.md5 = obj["md5"].as<String>();
  }
  if (obj.containsKey("size")) {
    out.size = obj["size"].as<int>();
  }

  if (!out.available) {
    if (out.version.length() > 0 && otaCompareVersions(out.version, FIRMWARE_VERSION) > 0 && out.url.length() > 0) {
      out.available = true;
    }
  }
  if (out.available && out.url.length() == 0) {
    out.available = false;
  }
  return true;
}

static bool otaFetchManifest(OtaInfo& out) {
  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }
  if (!otaEnabled || otaManifestUrl.length() == 0) {
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.setTimeout(30000);
  http.begin(client, otaManifestUrl);
  if (supabaseKey.length() > 0 && otaManifestUrl.startsWith(supabaseUrl)) {
    http.addHeader("apikey", supabaseKey);
    http.addHeader("Authorization", String("Bearer ") + supabaseKey);
  }
  http.addHeader("User-Agent", String("ESP32-Chair/") + FIRMWARE_VERSION);
  http.addHeader("Accept", "application/json, */*");
  http.addHeader("Accept-Encoding", "identity");
  http.addHeader("Cache-Control", "no-cache");
  http.addHeader("Connection", "close");

  int httpCode = -1;
  if (otaManifestUrl.indexOf("/rpc/") >= 0) {
    http.addHeader("Content-Type", "application/json");
    StaticJsonDocument<256> req;
    req["p_device_id"] = NUMERO_SERIE_CADEIRA;
    req["p_current_version"] = FIRMWARE_VERSION;
    req["p_is_esp32"] = true;
    String reqBody;
    serializeJson(req, reqBody);
    httpCode = http.POST(reqBody);
  } else {
    httpCode = http.GET();
  }

  if (httpCode != 200) {
    http.end();
    return false;
  }
  String body = http.getString();
  http.end();
  return otaParseManifestJson(body, out);
}

static bool otaDownloadAndUpdate(const OtaInfo& info) {
  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }
  if (info.url.length() == 0) {
    return false;
  }

  otaInProgress = true;
  enviarBLE("OTA:START");
  mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_START", false);
  mqttStatusDirty = true;

  if (mqttLockMs(200)) {
    if (mqttClient.connected()) {
      mqttClient.disconnect();
    }
    mqttUnlock();
  }

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.setTimeout(30000);
  http.begin(client, info.url);
  if (supabaseKey.length() > 0 && info.url.startsWith(supabaseUrl)) {
    http.addHeader("apikey", supabaseKey);
    http.addHeader("Authorization", String("Bearer ") + supabaseKey);
  }
  http.addHeader("User-Agent", String("ESP32-Chair/") + FIRMWARE_VERSION);
  http.addHeader("Accept", "application/octet-stream, */*");
  http.addHeader("Accept-Encoding", "identity");
  http.addHeader("Cache-Control", "no-cache");
  http.addHeader("Connection", "close");

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    otaInProgress = false;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_FAIL_HTTP", false);
    enviarBLE("OTA:FAIL");
    return false;
  }

  int contentLength = http.getSize();
  int expected = info.size;
  if (expected > 0) {
    contentLength = expected;
  }
  if (contentLength <= 0) {
    http.end();
    otaInProgress = false;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_FAIL_LEN", false);
    enviarBLE("OTA:FAIL");
    return false;
  }

  if (info.md5.length() > 0) {
    Update.setMD5(info.md5.c_str());
  }
  if (!Update.begin(contentLength)) {
    http.end();
    otaInProgress = false;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_FAIL_BEGIN", false);
    enviarBLE("OTA:FAIL");
    return false;
  }

  WiFiClient* stream = http.getStreamPtr();
  size_t written = Update.writeStream(*stream);
  if (written == 0) {
    Update.abort();
    http.end();
    otaInProgress = false;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_FAIL_WRITE", false);
    enviarBLE("OTA:FAIL");
    return false;
  }

  bool okEnd = Update.end();
  bool okFinished = Update.isFinished();
  http.end();
  if (!okEnd || !okFinished) {
    otaInProgress = false;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_FAIL_END", false);
    enviarBLE("OTA:FAIL");
    return false;
  }

  otaPendingVersion = info.version;
  otaSavePreferences();
  mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_OK_REBOOT", false);
  enviarBLE("OTA:OK");
  delay(2000);
  ESP.restart();
  return true;
}

static void otaValidateAfterBoot() {
  if (otaPendingVersion.length() == 0) {
    return;
  }
  if (otaPendingVersion == FIRMWARE_VERSION) {
    otaPendingVersion = "";
    otaSavePreferences();
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_VALIDATED", false);
    enviarBLE("OTA:VALIDATED");
  }
}

