joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
#if HAS_BLE
class MyServerCallbacks: public BLEServerCallbacks {
  void onConnect(BLEServer* pServer) {
    bleClienteConectado = true;
    bleAdvertisingAtivo = false;
    Serial.println("\n====================================");
    Serial.println("  [BLE] DISPOSITIVO CONECTADO!");
    Serial.println("====================================");
    Serial.print("Total de clientes conectados: ");
    Serial.println(pServer->getConnectedCount());
    Serial.println("====================================\n");
  };

  void onDisconnect(BLEServer* pServer) {
    bleClienteConectado = false;
    Serial.println("\n====================================");
    Serial.println("  [BLE] DISPOSITIVO DESCONECTADO");
    Serial.println("====================================");
    delay(500);
    if (WiFi.status() == WL_CONNECTED && mqttClient.connected()) {
      pServer->startAdvertising();
      bleAdvertisingAtivo = true;
      Serial.println("[BLE] Advertising reiniciado");
      Serial.println("Aguardando nova conexao...");
    } else {
      bleAdvertisingAtivo = false;
      Serial.println("[BLE] Advertising bloqueado (aguardando WiFi+MQTT)");
    }
    Serial.println("====================================\n");
  }
};

class MyCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pCharacteristic) {
    std::string rxValue = pCharacteristic->getValue();
    
    if (rxValue.length() > 0) {
      comandoBLE = "";
      for (int i = 0; i < rxValue.length(); i++) {
        comandoBLE += rxValue[i];
      }
      comandoBLE.trim();
      Serial.print("[BLE] Comando recebido: ");
      Serial.println(comandoBLE);
    }
  }
};
#endif

#if HAS_BLE
static void bleAtualizaDisponibilidade() {
  bool permitido = (WiFi.status() == WL_CONNECTED && mqttClient.connected());
  if (!permitido) {
    if (bleAdvertising && !bleClienteConectado) {
      bleAdvertising->stop();
      bleAdvertisingAtivo = false;
    }
    return;
  }
  if (!bleInicializado) {
    Serial.println("\n====================================");
    Serial.println("  INICIALIZANDO BLE");
    Serial.println("====================================");
    Serial.print("Inicializando BLE com nome: ");
    Serial.println(NOME_DISPOSITIVO);

    BLEDevice::init(NOME_DISPOSITIVO.c_str());
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    BLEService *pService = pServer->createService(SERVICE_UUID);
    pCharacteristicTX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_TX,
      BLECharacteristic::PROPERTY_NOTIFY | BLECharacteristic::PROPERTY_WRITE_NR
    );
    pCharacteristicTX->addDescriptor(new BLE2902());

    pCharacteristicRX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_RX,
      BLECharacteristic::PROPERTY_WRITE
    );
    pCharacteristicRX->setCallbacks(new MyCallbacks());
    pService->start();

    bleAdvertising = BLEDevice::getAdvertising();
    bleAdvertising->addServiceUUID(SERVICE_UUID);
    bleAdvertising->setScanResponse(true);
    bleAdvertising->setMinPreferred(0x06);
    bleAdvertising->setMaxPreferred(0x12);
    BLEDevice::startAdvertising();
    bleInicializado = true;
    bleAdvertisingAtivo = true;

    Serial.println("[OK] BLE iniciado e advertising ativo!");
    Serial.print("Nome BLE: ");
    Serial.println(NOME_DISPOSITIVO);
    Serial.println("UUID do Serviço: 6E400001-B5A3-F393-E0A9-E50E24DCCA9E");
    Serial.println("Aguardando conexão de cliente BLE...");
    Serial.println("====================================\n");
    return;
  }
  if (!bleClienteConectado && bleAdvertising && !bleAdvertisingAtivo) {
    BLEDevice::startAdvertising();
    bleAdvertisingAtivo = true;
  }
}
#endif

void enviarBLE(String msg) {
#if HAS_BLE
  if (bleClienteConectado && pCharacteristicTX != NULL) {
    pCharacteristicTX->setValue(msg.c_str());
    pCharacteristicTX->notify();
    Serial.print("[BLE] Enviado: ");
    Serial.println(msg);
  }
#else
  Serial.println(msg);
#endif
}

// Constantes - Pinos de ENTRADA (botÃµes)
const int M1 = PCF_PIN(0);
const int SE = PCF_PIN(1);
const int PT = PCF_PIN(2);
const int VZ = PCF_PIN(3);
const int DP = PCF_PIN(4);
const int SP = PCF_PIN(5);
const int DE = PCF_PIN(6);
const int DA = PCF_PIN(7);
const int SA = PIN_SA;
const int RF = PIN_RF;
int GAVETA = PIN_GAVETA;
const int ENCODER1 = PIN_ENCODER1;
const int ENCODER2 = PIN_ENCODER2;
const int ENCODER3 = PIN_ENCODER3;
const int TREN_INT_DESCE = PIN_TREN_INT_DESCE;
const int INT_TREND_DESCE = PIN_INT_TREND_DESCE;

static void loadGavetaPinPreference() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    GAVETA = PIN_GAVETA;
    return;
  }
  GAVETA = p.getInt("gaveta_pin", PIN_GAVETA);
  p.end();
}

static void saveGavetaPinPreference() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    return;
  }
  p.putInt("gaveta_pin", GAVETA);
  p.end();
}

static bool isGavetaAberta() {
  if (ignoreGavetaLock) {
    return false;
  }
  if (GAVETA < 0) {
    return false;
  }
  return digitalRead(GAVETA) == LOW;
}

static bool isGavetaAbertaRaw() {
  if (GAVETA < 0) {
    return false;
  }
  return digitalRead(GAVETA) == LOW;
}

extern int fim_encosto_encoder;
extern int fim_asento_encoder;
extern int fim_perneira_encoder;

static void loadCalibracaoLimites() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    return;
  }
  bool done = p.getBool("cal_done", false);
  if (!done) {
    p.end();
    return;
  }
  int enc = p.getInt("encosto_max", fim_encosto_encoder);
  int ass = p.getInt("assento_max", fim_asento_encoder);
  int per = p.getInt("perneira_max", fim_perneira_encoder);
  p.end();
  if (enc > 0) fim_encosto_encoder = enc;
  if (ass > 0) fim_asento_encoder = ass;
  if (per > 0) fim_perneira_encoder = per;
  Serial.print("[CAL] Limites carregados ENC=");
  Serial.print(fim_encosto_encoder);
  Serial.print(" ASS=");
  Serial.print(fim_asento_encoder);
  Serial.print(" PER=");
  Serial.println(fim_perneira_encoder);
}

static void loadMqttPreferences() {
  Preferences p;
  if (!p.begin("mqtt", true)) {
    return;
  }
  bool migrated = false;
  if (p.isKey("migrated")) {
    migrated = p.getBool("migrated", false);
  }
  if (p.isKey("host")) {
    mqttHost = p.getString("host", mqttHost);
  }
  if (p.isKey("port")) {
    uint32_t port = p.getUInt("port", 0);
    if (port > 0 && port <= 65535) {
      mqttPort = static_cast<uint16_t>(port);
    }
  }
  if (p.isKey("user")) {
    mqttUser = p.getString("user", "");
  }
  if (p.isKey("pass")) {
    mqttPass = p.getString("pass", "");
  }
  if (p.isKey("tls")) {
    mqttUseTls = p.getBool("tls", mqttUseTls);
  }
  if (p.isKey("cid")) {
    mqttClientId = p.getString("cid", "");
  }
  if (p.isKey("clean")) {
    mqttCleanSession = p.getBool("clean", mqttCleanSession);
  }
  p.end();

  if (!migrated && mqttHost == "broker.emqx.io") {
    mqttHost = "test.mosquitto.org";
    mqttPort = 1883;
    mqttUser = "";
    mqttPass = "";
    mqttUseTls = false;
    mqttClientId = "";
    mqttCleanSession = true;
    Preferences w;
    if (w.begin("mqtt", false)) {
      w.putString("host", mqttHost);
      w.putUInt("port", mqttPort);
      w.putString("user", mqttUser);
      w.putString("pass", mqttPass);
      w.putBool("tls", mqttUseTls);
      w.putString("cid", mqttClientId);
      w.putBool("clean", mqttCleanSession);
      w.putBool("migrated", true);
      w.end();
    }
  }
}

static void saveMqttPreferences() {
  Preferences p;
  if (!p.begin("mqtt", false)) {
    return;
  }
  p.putString("host", mqttHost);
  p.putUInt("port", mqttPort);
  p.putString("user", mqttUser);
  p.putString("pass", mqttPass);
  p.putBool("tls", mqttUseTls);
  p.putString("cid", mqttClientId);
  p.putBool("clean", mqttCleanSession);
  p.end();
}

static void applyMqttRuntimeConfig() {
  bool locked = mqttLockMs(200);
  if (!locked) {
    return;
  }
  if (mqttUseTls && mqttPort == 1883) {
    mqttPort = 8883;
  } else if (!mqttUseTls && mqttPort == 8883) {
    mqttPort = 1883;
  }
  if (mqttUseTls) {
    mqttSecureClient.setInsecure();
    mqttClient.setClient(mqttSecureClient);
  } else {
    mqttClient.setClient(mqttPlainClient);
  }
  mqttClient.setServer(mqttHost.c_str(), mqttPort);
  mqttUnlock();
}

// Constantes - Pinos de SAÃDA (relÃ©s e indicadores)
#ifndef PIN_RELE_SA
#define PIN_RELE_SA 33
#endif
#ifndef PIN_RELE_DA
#define PIN_RELE_DA 25
#endif
#ifndef PIN_RELE_SE
#define PIN_RELE_SE 27
#endif
#ifndef PIN_RELE_DE
#define PIN_RELE_DE 26
#endif
#ifndef PIN_RELE_SP
#define PIN_RELE_SP 12
#endif
#ifndef PIN_RELE_DP
#define PIN_RELE_DP 14
#endif
#ifndef PIN_RELE_REFLETOR
#define PIN_RELE_REFLETOR 4
#endif
#ifndef PIN_RELE_TREND_DESCE
#define PIN_RELE_TREND_DESCE -1
#endif
#ifndef PIN_RELE_TREND_SOBE
#define PIN_RELE_TREND_SOBE -1
#endif
#ifndef PIN_LED
#define PIN_LED 2
#endif
#ifndef PIN_BUZZER
#define PIN_BUZZER 32
#endif

const int Rele_SA = PIN_RELE_SA;
const int Rele_DA = PIN_RELE_DA;
const int Rele_SE = PIN_RELE_SE;
const int Rele_DE = PIN_RELE_DE;
const int Rele_SP = PIN_RELE_SP;
const int Rele_DP = PIN_RELE_DP;
const int LED = PIN_LED;
const int Rele_refletor = PIN_RELE_REFLETOR;
const int Rele_TREND_DESCE = PIN_RELE_TREND_DESCE;
const int Rele_TREND_SOBE = PIN_RELE_TREND_SOBE;
const int BUZZER = PIN_BUZZER;

static void buzzerTestTick() {
  uint32_t now = millis();
  if (!buzzerTestEnabled) {
    if (buzzerTestIsOn) {
      digitalWrite(BUZZER, LOW);
      buzzerTestIsOn = false;
    }
    return;
  }
  if (!buzzerTestIsOn) {
    if (static_cast<int32_t>(now - buzzerTestNextOnMs) >= 0) {
      digitalWrite(BUZZER, HIGH);
      buzzerTestIsOn = true;
      buzzerTestOffAtMs = now + 80;
      buzzerTestNextOnMs = now + 2000;
    }
    return;
  }
  if (static_cast<int32_t>(now - buzzerTestOffAtMs) >= 0) {
    digitalWrite(BUZZER, LOW);
    buzzerTestIsOn = false;
  }
}

static const char* relayLabelByPin(int pin) {
  if (pin == Rele_SA) return "RELE_SA";
  if (pin == Rele_DA) return "RELE_DA";
  if (pin == Rele_SE) return "RELE_SE";
  if (pin == Rele_DE) return "RELE_DE";
  if (pin == Rele_SP) return "RELE_SP";
  if (pin == Rele_DP) return "RELE_DP";
  if (pin == Rele_TREND_SOBE) return "RELE_TREND_SOBE";
  if (pin == Rele_TREND_DESCE) return "RELE_TREND_DESCE";
  if (pin == Rele_refletor) return "RELE_REFLETOR";
  if (pin == LED) return "LED";
  if (pin == BUZZER) return "BUZZER";
  return "GPIO";
}

static void setOutputPin(int pin, bool on, const char* src, bool log = true) {
  int newValue = on ? HIGH : LOW;
  int oldValue = digitalRead(pin);
  if (oldValue == newValue) {
    return;
  }
  digitalWrite(pin, newValue);
  int readBack = digitalRead(pin);
  if (pin == Rele_SA || pin == Rele_DA || pin == Rele_SE || pin == Rele_DE || pin == Rele_SP || pin == Rele_DP || pin == Rele_refletor || pin == Rele_TREND_SOBE || pin == Rele_TREND_DESCE) {
    mqttStatusDirty = true;
  }
  if (!log) {
    return;
  }
  Serial.print("[GPIO_OUT] ");
  Serial.print(relayLabelByPin(pin));
  Serial.print("(GPIO");
  Serial.print(pin);
  Serial.print(")=");
  Serial.print(on ? "1" : "0");
  Serial.print(" RB=");
  Serial.print(readBack == HIGH ? "1" : "0");
  if (src && src[0] != '\0') {
    Serial.print(" ");
    Serial.print(src);
  }
  Serial.println();
}

#if defined(I2C_SDA) && defined(I2C_SCL)
  #if (I2C_SDA == PIN_RELE_SA) || (I2C_SCL == PIN_RELE_SA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SA"
  #endif
  #if (I2C_SDA == PIN_RELE_DA) || (I2C_SCL == PIN_RELE_DA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DA"
  #endif
  #if (I2C_SDA == PIN_RELE_SE) || (I2C_SCL == PIN_RELE_SE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SE"
  #endif
  #if (I2C_SDA == PIN_RELE_DE) || (I2C_SCL == PIN_RELE_DE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DE"
  #endif
  #if (I2C_SDA == PIN_RELE_SP) || (I2C_SCL == PIN_RELE_SP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SP"
  #endif
  #if (I2C_SDA == PIN_RELE_DP) || (I2C_SCL == PIN_RELE_DP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DP"
  #endif
  #if (I2C_SDA == PIN_RELE_REFLETOR) || (I2C_SCL == PIN_RELE_REFLETOR)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_REFLETOR"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_DESCE) || (I2C_SCL == PIN_RELE_TREND_DESCE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_DESCE"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_SOBE) || (I2C_SCL == PIN_RELE_TREND_SOBE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_SOBE"
  #endif
#endif

static int botaoResetWifiPin = RF;
static bool rfHabilitado = true;

