joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
// VariÃ¡veis de estado dos botÃµes
int buttonState = 0;
int buttonState1 = 0;
int buttonState2 = 0;
int buttonState3 = 0;
int buttonState4 = 0;
int buttonState5 = 0;
int buttonState6 = 0;
int buttonState7 = 0;
int buttonState8 = 0;
int buttonState9 = 0;
int buttonState10 = 0;
int buttonState11 = 0;
int buttonState12 = 0;

unsigned long previousMillis = 0;
unsigned long currentMillis;
unsigned long interval = 500;

int ledState = 0;
int cont = 0;
int contador = 0;
int contador1 = 0;
int contador2 = 0;
int cont15 = 0;
int contador21 = 0;

// VariÃ¡veis do encoder virtual
int incoder_virtual_encosto_M1 = 0;
int incoder_virtual_asento_M1 = 0;
int incoder_virtual_perneira_M1 = 0;
int cont_bt_m1 = 0;
int incoder_virtual_encosto_service = 0;
int incoder_virtual_asento_service = 0;
int incoder_virtual_perneira_service = 0;
int cont12 = 0;

// Limites do encoder virtual
int fim_encosto_encoder = 0;
int fim_asento_encoder = 0;
int fim_perneira_encoder = 0;
static bool calibrationInProgress = false;

int cont13 = 0;

bool estado_r = 0;
bool estado_sp = 0;
bool estado_dp = 0;
bool estado_sa = 0;
bool estado_da = 0;
bool estado_se = 0;
bool estado_de = 0;
bool estado_trend_sobe = 0;
bool estado_trend_desce = 0;
bool faz_bt_seg = 0;

volatile uint32_t pulses_encosto = 0;
volatile uint32_t pulses_assento = 0;
volatile uint32_t pulses_perneira = 0;
static uint32_t last_pulses_encosto = 0;
static uint32_t last_pulses_assento = 0;
static uint32_t last_pulses_perneira = 0;

static uint64_t motorTravelPulsesEncosto = 0;
static uint64_t motorTravelPulsesAssento = 0;
static uint64_t motorTravelPulsesPerneira = 0;
static uint64_t motorTravelUnsavedEncosto = 0;
static uint64_t motorTravelUnsavedAssento = 0;
static uint64_t motorTravelUnsavedPerneira = 0;
static float mmPerPulseEncosto = 0.01f;
static float mmPerPulseAssento = 0.01f;
static float mmPerPulsePerneira = 0.01f;
static uint32_t motorTravelNextSaveMs = 0;
static uint32_t motorTravelNextSendMs = 0;
static const uint32_t MOTOR_TRAVEL_SAVE_INTERVAL_MS = 10000;
static const uint32_t MOTOR_TRAVEL_SEND_INTERVAL_MS = 900000;
static bool encoderPulseDebug = false;

// Mapeamento solicitado:
// ENCODER1 -> Assento
// ENCODER2 -> Perneira
// ENCODER3 -> Encosto
static void IRAM_ATTR isr_encoder1() { pulses_assento++; }
static void IRAM_ATTR isr_encoder2() { pulses_perneira++; }
static void IRAM_ATTR isr_encoder3() { pulses_encosto++; }

// Debounce para comandos BLE
unsigned long ultimoComandoBLE = 0;
String ultimoCmdBLE = "";
unsigned long ultimoComandoRemoto = 0;

// Timeout para motores (dead man's switch) - desliga se não receber comando
const unsigned long MOTOR_TIMEOUT = 1000; // 1 segundo
unsigned long ultimoComandoSE = 0;
unsigned long ultimoComandoDE = 0;
unsigned long ultimoComandoSA = 0;
unsigned long ultimoComandoDA = 0;
unsigned long ultimoComandoSP = 0;
unsigned long ultimoComandoDP = 0;
unsigned long ultimoComandoTrendSobe = 0;
unsigned long ultimoComandoTrendDesce = 0;
const uint32_t VZ_MAX_TIME_MS = 15000;

// Flags para controle de fim de curso do encoder
bool en_SA_acabou = false;
bool en_DA_acabou = false;
bool en_SE_acabou = false;
bool en_DE_acabou = false;
bool en_SP_acabou = false;
bool en_DP_acabou = false;

bool faz_m1 = false;

// Travas de botÃµes baseadas no encoder virtual
bool trava_bt_DA = true;
bool trava_bt_SA = false;
bool trava_bt_SE = true;
bool trava_bt_DE = false;
bool trava_bt_DP = true;
bool trava_bt_SP = false;

unsigned long currentMillis20 = 0;
unsigned long previousMillis_amostra20 = 0;
unsigned long ultimoMillisEncoder = 0;
unsigned long ultimoMillisPiscaLed = 0;
bool estadoLedPisca = false;
const unsigned long INTERVALO_ENCODER = 250;
bool habilitaEncoderVirtual = true; // Controle para desabilitar encoder durante VZ inicial
bool vzInicialEmAndamento = false; // Flag para bloquear loop() durante VZ inicial

void monitoraSistema();

// ========== SETUP ==========
void setup() {
  // WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Desabilita detector de Brownout - not needed in Arduino
  setCpuFrequencyMhz(80); // Reduz frequÃªncia para 80MHz durante inicializaÃ§Ã£o
  
  Serial.begin(115200);
  delay(2000);

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_deinit();
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = 120000,
      .idle_core_mask = (1 << 0) | (1 << 1),
      .trigger_panic = true,
  };
  esp_task_wdt_init(&twdt_config);
#else
  esp_task_wdt_deinit();
  esp_task_wdt_init(120, true);
#endif

#if I2C_EARLY_TEST
  #if defined(I2C_SDA) && defined(I2C_SCL)
  pinMode(I2C_SDA, INPUT_PULLUP);
  pinMode(I2C_SCL, INPUT_PULLUP);
  Wire.begin(I2C_SDA, I2C_SCL);
  #elif defined(PCF8575_SDA) && defined(PCF8575_SCL)
  pinMode(PCF8575_SDA, INPUT_PULLUP);
  pinMode(PCF8575_SCL, INPUT_PULLUP);
  Wire.begin(PCF8575_SDA, PCF8575_SCL);
  #else
  Wire.begin();
  #endif
  Wire.setClock(I2C_CLOCK_HZ);
  Serial.println("\n=== I2C EARLY TEST MODE ===");
  Serial.print("[I2C] Clock: ");
  Serial.println(I2C_CLOCK_HZ);
  #if defined(I2C_SDA) && defined(I2C_SCL)
  Serial.print("[I2C] SDA=");
  Serial.print(I2C_SDA);
  Serial.print(" SCL=");
  Serial.println(I2C_SCL);
  Serial.print("[I2C] SDA level=");
  Serial.print(digitalRead(I2C_SDA));
  Serial.print(" SCL level=");
  Serial.println(digitalRead(I2C_SCL));
  #endif
  Serial.println("Digite: I2C_SCAN, PCF8574_PING, PCF8574_TEST");
  Serial.print("[I2C] Scan inicial: ");
  Serial.println(i2cScanSummary());
  while (true) {
    processaComandosSerialDebug();
    delay(10);
  }
#endif
  
  Serial.println("\n--- INICIALIZANDO SISTEMA ---");
  Serial.print("CPU0 Reset Reason: "); Serial.println(esp_reset_reason());
  Serial.print("CPU1 Reset Reason: "); Serial.println(esp_reset_reason());
  
  // Gera nÃºmero de sÃ©rie Ãºnico baseado no MAC ID do ESP32
  Serial.println("Gerando numero de serie...");
  NUMERO_SERIE_CADEIRA = geraNumeroSerieDoMAC();
  Serial.print("Numero de Serie: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  
  // Define base dos tópicos MQTT
  MQTT_TOPIC_BASE = NUMERO_SERIE_CADEIRA + "/";
  loadMqttPreferences();
  applyMqttRuntimeConfig();
  
  // Gera nome do dispositivo (últimos 4 dígitos do MAC)
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char nomeTemp[20];
  snprintf(nomeTemp, sizeof(nomeTemp), "CadeiraOdonto-%02X%02X", mac[4], mac[5]);
  NOME_DISPOSITIVO = String(nomeTemp);
  Serial.print("Nome do Dispositivo: ");
  Serial.println(NOME_DISPOSITIVO);
  delay(500);

  IO_begin();
  
  // ConfiguraÃ§Ã£o de pinos primeiro (menor consumo)
  Serial.println("Configurando pinos GPIO...");

  // Inicializa pinos de entrada com pull-up
  loadGavetaPinPreference();
  loadCalibracaoLimites();
  pinMode(DE, INPUT_PULLUP);
  pinMode(SA, INPUT_PULLUP);
  pinMode(DA, INPUT_PULLUP);
  pinMode(SE, INPUT_PULLUP);
  pinMode(RF, INPUT_PULLUP);
  pinMode(VZ, INPUT_PULLUP);
  pinMode(PT, INPUT_PULLUP);
  pinMode(SP, INPUT_PULLUP);
  pinMode(DP, INPUT_PULLUP);
  pinMode(M1, INPUT_PULLUP);
  if (TREN_INT_DESCE >= 0) {
    pinMode(TREN_INT_DESCE, INPUT_PULLUP);
    Serial.print("[TREND] TREN_INT_DESCE(GPIO");
    Serial.print(TREN_INT_DESCE);
    Serial.println(")");
  }
  if (INT_TREND_DESCE >= 0) {
    pinMode(INT_TREND_DESCE, INPUT_PULLUP);
    Serial.print("[TREND] INT_TREND_DESCE(GPIO");
    Serial.print(INT_TREND_DESCE);
    Serial.println(")");
  }
  if (GAVETA >= 0) {
    pinMode(GAVETA, INPUT_PULLUP);
    Serial.print("[GAVETA] GPIO=");
    Serial.println(GAVETA);
  } else {
    Serial.println("[GAVETA] DESABILITADO");
  }
  pinMode(ENCODER1, INPUT_PULLUP);
  pinMode(ENCODER2, INPUT_PULLUP);
  pinMode(ENCODER3, INPUT_PULLUP);
  if (TEST_MODE) {
    Serial.println("[ENC] TEST_MODE=1: interrupcoes de encoder desabilitadas");
  } else {
    if (ENCODER1 >= 0 && ENCODER1 != I2C_SDA && ENCODER1 != I2C_SCL && ENCODER1 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER1), isr_encoder1, FALLING);
    } else {
      Serial.println("[ENC] ENCODER1 desabilitado");
    }
    if (ENCODER2 >= 0 && ENCODER2 != I2C_SDA && ENCODER2 != I2C_SCL && ENCODER2 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER2), isr_encoder2, FALLING);
    } else {
      Serial.println("[ENC] ENCODER2 desabilitado");
    }
    if (ENCODER3 >= 0 && ENCODER3 != I2C_SDA && ENCODER3 != I2C_SCL && ENCODER3 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER3), isr_encoder3, FALLING);
    } else {
      Serial.println("[ENC] ENCODER3 desabilitado");
    }
  }

