joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  // Inicializa pinos de saÃ­da
  pinMode(Rele_SA, OUTPUT);
  pinMode(Rele_DA, OUTPUT);
  pinMode(Rele_SE, OUTPUT);
  pinMode(Rele_DE, OUTPUT);
  pinMode(Rele_DP, OUTPUT);
  pinMode(Rele_SP, OUTPUT);
  pinMode(BUZZER, OUTPUT);
  pinMode(LED, OUTPUT);
  pinMode(Rele_refletor, OUTPUT);
  if (Rele_TREND_DESCE >= 0) pinMode(Rele_TREND_DESCE, OUTPUT);
  if (Rele_TREND_SOBE >= 0) pinMode(Rele_TREND_SOBE, OUTPUT);

  // Desliga todos os relÃ©s no inÃ­cio
  setOutputPin(Rele_SA, false, nullptr, false);
  setOutputPin(Rele_DA, false, nullptr, false);
  setOutputPin(Rele_SE, false, nullptr, false);
  setOutputPin(Rele_DE, false, nullptr, false);
  setOutputPin(Rele_DP, false, nullptr, false);
  setOutputPin(Rele_SP, false, nullptr, false);
  setOutputPin(Rele_refletor, false, nullptr, false);
  if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, nullptr, false);
  if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, nullptr, false);
  Serial.println("Pinos configurados.");
  delay(500);

  if (RF == Rele_SA || RF == Rele_DA || RF == Rele_SE || RF == Rele_DE || RF == Rele_SP || RF == Rele_DP || RF == Rele_refletor || RF == BUZZER || RF == LED) {
    rfHabilitado = false;
    botaoResetWifiPin = -1;
    Serial.println("[ERRO] RF conflita com um pino de saida. RF desabilitado.");
  } else {
    rfHabilitado = true;
    botaoResetWifiPin = RF;
  }

  inicializaEstadosDeBordaBotoes();
  loadMotorTravelPreferences();

#if PORTS_ONLY
  Serial.println("\n=== PORTS ONLY MODE ===");
  Serial.println("Comandos: I2C_SCAN | PCF8574_PING | PCF8574_TEST | PCF8574_BTNS | GPIO_BTNS | PCF8574_INT");
  bip();
  return;
#endif

#if PORTS_VERIFY
  Serial.println("\n=== PORTS VERIFY MODE ===");
  Serial.println("Teste completo: botoes (PCF8574) -> rotinas -> reles (GPIO)");
  Serial.println("Use: PCF8574_BTNS | PCF8574_INT | GPIO_BTNS");
  bip();
  return;
#endif

  // ===== EXECUTA VZ INICIAL ANTES DE TUDO =====
  Serial.println("\n====================================");
  Serial.println("  EXECUTANDO VZ INICIAL");
  Serial.println("  (ANTES de WiFi e Bluetooth)");
  Serial.println("====================================");
  executa_vz_ini();
  Serial.println("[OK] VZ inicial finalizado.");
  Serial.println("====================================\n");
  delay(1000);
  Serial.println("Inicio programa cadeira GO - Com WiFiManager + Supabase");

  // Carrega dados salvos (encoder virtual e horÃ­metro)
  Serial.println("Carregando preferencias...");
  carregaPreferencias();
  otaLoadPreferences();
  delay(500);

  // Volta CPU para 240MHz antes do WiFi
  setCpuFrequencyMhz(240);
  Serial.println("CPU em 240MHz - Iniciando WiFi...");
  delay(1000);

  // Configura e conecta WiFi usando WiFiManager
  configuraWiFiManager();

  // Inicializa MQTT se WiFi estiver conectado
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\n====================================");
    Serial.println("  INICIALIZANDO MQTT");
    Serial.println("====================================");
    applyMqttRuntimeConfig();
    mqttClient.setCallback(mqttCallback);
    Serial.print("Servidor MQTT: ");
    Serial.println(mqttHost);
    Serial.print("Porta: ");
    Serial.println(mqttPort);
    Serial.print("TLS: ");
    Serial.println(mqttUseTls ? "SIM" : "NAO");
    Serial.print("Usuario: ");
    Serial.println(mqttUser.length() > 0 ? mqttUser : "(vazio)");
    Serial.print("Base dos tópicos: ");
    Serial.println(MQTT_TOPIC_BASE);
    Serial.println("====================================\n");
  }

  if (!mqttMutex) {
    mqttMutex = xSemaphoreCreateRecursiveMutex();
  }
  if (!mqttCommandQueue) {
    mqttCommandQueue = xQueueCreate(10, sizeof(MqttCmdItem));
  }
  if (!mqttTxQueue) {
    mqttTxQueue = xQueueCreate(8, sizeof(MqttTxItem));
  }
  if (!mqttTaskHandle) {
    xTaskCreatePinnedToCore(mqttTaskMain, "mqtt", 12288, NULL, 0, &mqttTaskHandle, 0);
  }
  otaValidateAfterBoot();

  // Delay para estabilizar rede
  Serial.println("Aguardando estabilizacao da rede...");
  delay(2000);

  // Sincroniza horário com servidor NTP
  if (WiFi.status() == WL_CONNECTED) {
    sincronizaNTP();
  }

  Serial.println("\n====================================");
  Serial.println("  INICIANDO CONEXAO COM SUPABASE");
  Serial.println("====================================");
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi Status: CONECTADO | IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Heap livre antes: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    
    verificaStatusCadeira();
    
    Serial.print("Heap livre depois: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    Serial.println("[OK] Verificacao de status concluida.");
  } else {
    Serial.println("WiFi Status: DESCONECTADO");
    Serial.println("[INFO] Pulando verificacao inicial - modo offline.");
  }
  
  Serial.println("\n====================================");
  Serial.println("       SISTEMA PRONTO!");
  Serial.println("====================================");
  Serial.print("Nome: ");
  Serial.println(NOME_DISPOSITIVO);
  Serial.print("Serial: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  Serial.print("WiFi: ");
  Serial.println(WiFi.status() == WL_CONNECTED ? "ONLINE" : "OFFLINE");
  Serial.print("Memoria livre: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  Serial.println("====================================");
  
  bip();
  delay(100);
  bip();
}

// ========== MONITORAMENTO DE TIMEOUT DOS MOTORES (DEAD MAN'S SWITCH) ==========
void verificaTimeoutMotores() {
  unsigned long agora = millis();
  
  // SE - Encosto sobe
  if (estado_se && (agora - ultimoComandoSE) > MOTOR_TIMEOUT) {
    estado_se = false;
    setOutputPin(Rele_SE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SE:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SE desligado por seguranca");
  }
  
  // DE - Encosto desce
  if (estado_de && (agora - ultimoComandoDE) > MOTOR_TIMEOUT) {
    estado_de = false;
    setOutputPin(Rele_DE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DE:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DE desligado por seguranca");
  }
  
  // SA - Assento sobe
  if (estado_sa && (agora - ultimoComandoSA) > MOTOR_TIMEOUT) {
    estado_sa = false;
    setOutputPin(Rele_SA, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SA:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SA desligado por seguranca");
  }
  
  // DA - Assento desce
  if (estado_da && (agora - ultimoComandoDA) > MOTOR_TIMEOUT) {
    estado_da = false;
    setOutputPin(Rele_DA, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DA:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DA desligado por seguranca");
  }
  
  // SP - Pernas sobem
  if (estado_sp && (agora - ultimoComandoSP) > MOTOR_TIMEOUT) {
    estado_sp = false;
    setOutputPin(Rele_SP, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SP:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SP desligado por seguranca");
  }
  
  // DP - Pernas descem
  if (estado_dp && (agora - ultimoComandoDP) > MOTOR_TIMEOUT) {
    estado_dp = false;
    setOutputPin(Rele_DP, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DP:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DP desligado por seguranca");
  }

  // TS - Trend sobe
  if (estado_trend_sobe && (agora - ultimoComandoTrendSobe) > MOTOR_TIMEOUT) {
    estado_trend_sobe = false;
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("TS:TIMEOUT");
    Serial.println("[TIMEOUT] Motor TS desligado por seguranca");
  }

  // TD - Trend desce
  if (estado_trend_desce && (agora - ultimoComandoTrendDesce) > MOTOR_TIMEOUT) {
    estado_trend_desce = false;
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("TD:TIMEOUT");
    Serial.println("[TIMEOUT] Motor TD desligado por seguranca");
  }
}

// ========== LOOP PRINCIPAL ==========
void loop() {
#if PORTS_ONLY || PORTS_VERIFY
  if (pcf8574InterruptPending) {
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    if (okRead) {
      pcf8574ReportChanges(pcf8574LastIn, in);
      pcf8574LastIn = in;
    }
    pcf8574InterruptPending = false;
  }
  processaComandosBluetooth();
#if PORTS_VERIFY
  Button_geral();
  Button_Seg();
  monitora_tempo_rele();
  contagem_tempo_incoder_virtual();
#endif
  delay(10);
  return;
#endif
  // Se VZ inicial estiver em andamento, nÃ£o executa nada do loop
  if (vzInicialEmAndamento) {
    delay(100);
    return;
  }
  
