joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  // Verifica se botÃ£o de reset WiFi foi pressionado por 5 segundos
  verificaBotaoResetWifi();
  
  // Verifica timeout dos motores (dead man's switch)
  verificaTimeoutMotores();
  
  // Processa comandos Bluetooth do app
  processaComandosBluetooth();
  if (mqttCommandQueue) {
    MqttCmdItem item;
    while (xQueueReceive(mqttCommandQueue, &item, 0) == pdTRUE) {
      String cmd = String(item.cmd);
      cmd.trim();
      if (cmd.length() > 0) {
        executaComandoBluetooth(cmd, "MQTT");
      }
    }
  }

  // Monitoramento do sistema (Debug)
  monitoraSistema();

  // Atualiza horÃ­metro
  atualizaHorimetro();

  // Envia dados ao Supabase periodicamente
  atualizaSupabase();
  sendMotorTravelToSupabaseIfNeeded();

  // Verifica status da cadeira periodicamente
  verificacaoPeriodicaStatus();

  // FunÃ§Ãµes originais de controle
  contagem_tempo_incoder_virtual();
  Watch_Dog();
  buzzerTestTick();
  Button_Seg();
  Button_geral();
  monitora_tempo_rele();
  if (mqttStatusDirty && mqttClient.connected() && (millis() - mqttLastStatusPublishMs) > 250) {
    mqttStatusDirty = false;
    mqttLastStatusPublishMs = millis();
    publicaStatusMQTT();
  }
  otaTick();

#if HAS_BLE
  bleAtualizaDisponibilidade();
#endif
}

// ========== GERAÃ‡ÃƒO DO NÃšMERO DE SÃ‰RIE BASEADO NO MAC ==========
String geraNumeroSerieDoMAC() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  
  // Formato: CADEIRA-XXXXXXXXXXXX (12 caracteres hexadecimais do MAC)
  char serial[25];
  snprintf(serial, sizeof(serial), "CADEIRA-%02X%02X%02X%02X%02X%02X", 
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  
  return String(serial);
}

// ========== CONFIGURAÃ‡ÃƒO WIFI MANAGER ==========
void configuraWiFiManager() {
  Serial.println("[WiFi] Configurando WiFiManager...");
  
  // Configura timeout para o portal de configuração
  wifiManager.setConfigPortalTimeout(TIMEOUT_CONFIG_WIFI);
  
  // Configura título do portal (sem acentuação para evitar problemas de encoding)
  wifiManager.setTitle("VIP Hospitalar - Cadeira Odontologica");
  
  // Adiciona logo VIP Hospitalar no topo do portal
  wifiManager.setCustomHeadElement(LOGO_VIP_HOSPITALAR);
  
  // Adiciona informação da cadeira no menu
  String infoHTML = "<div style='text-align:center; margin:10px; padding:10px; background:#f0f0f0; border-radius:5px;'><b>" + NOME_DISPOSITIVO + "</b><br><small>Serial: " + NUMERO_SERIE_CADEIRA + "</small></div>";
  wifiManager.setCustomMenuHTML(infoHTML.c_str());
  
  Serial.println("[WiFi] Tentando conectar...");
  
  // autoConnect tenta conectar com credenciais salvas
  // Se falhar, abre um Access Point para configuraÃ§Ã£o
  if (!wifiManager.autoConnect(NOME_DISPOSITIVO.c_str(), SENHA_AP)) {
    Serial.println("[WiFi] Falha na conexÃ£o - timeout");
    Serial.println("[WiFi] Continuando em modo offline...");
    
    // 3 bips indicam falha
    bip(); delay(200);
    bip(); delay(200);
    bip();
  } else {
    Serial.println("WiFi conectado!");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("SSID: ");
    Serial.println(WiFi.SSID());
    
    // 2 bips indicam sucesso
    bip(); delay(100);
    bip();
    supabaseLogUsage("WIFI_CONNECTED");
    #if !(PORTS_ONLY) && !(PORTS_VERIFY)
    iniciaCalibracaoSeNecessario();
    #endif
  }
}

// Verifica se botÃ£o de reset WiFi estÃ¡ pressionado por 5 segundos
void verificaBotaoResetWifi() {
  if (botaoResetWifiPin >= 0 && digitalRead(botaoResetWifiPin) == LOW) {
    if (!botaoResetWifiPressionado) {
      tempoPressionadoBotaoResetWifi = millis();
      botaoResetWifiPressionado = true;
    } else {
      // Verifica se passou 5 segundos
      if (millis() - tempoPressionadoBotaoResetWifi >= 5000) {
        Serial.println("Resetando configuraÃ§Ãµes WiFi...");
        resetaConfiguracoesWifi();
        botaoResetWifiPressionado = false;
      }
    }
  } else {
    botaoResetWifiPressionado = false;
  }
}

// Reseta configuraÃ§Ãµes WiFi e reinicia o ESP
void resetaConfiguracoesWifi() {
  // Bips indicando reset
  for (int i = 0; i < 5; i++) {
    bip();
    delay(100);
  }
  
  // Limpa credenciais salvas
  wifiManager.resetSettings();

  Preferences p;
  p.begin("cadeira", false);
  p.remove("cal_done");
  p.remove("encosto_max");
  p.remove("assento_max");
  p.remove("perneira_max");
  p.end();
  
  Serial.println("ConfiguraÃ§Ãµes WiFi apagadas. Reiniciando...");
  delay(1000);
  
  // Reinicia o ESP32
  ESP.restart();
}

void resetCalibracao() {
  Preferences p;
  p.begin("cadeira", false);
  p.remove("cal_done");
  p.remove("encosto_max");
  p.remove("assento_max");
  p.remove("perneira_max");
  p.end();
  fim_encosto_encoder = 0;
  fim_asento_encoder = 0;
  fim_perneira_encoder = 0;
  Serial.println("[CAL] Dados de calibracao apagados (cal_done, *_max).");
}

// ========== BLUETOOTH - PROCESSA COMANDOS DO APP ==========
void processaComandosBluetooth() {
#if HAS_BLE
  if (comandoBLE.length() > 0) {
    String cmd = comandoBLE;
    comandoBLE = "";
    cmd.trim();
    String cmdUpper = cmd;
    cmdUpper.toUpperCase();
    bool isMotorCmd = (cmdUpper == "SE" || cmdUpper == "DE" || cmdUpper == "SA" || 
                       cmdUpper == "DA" || cmdUpper == "SP" || cmdUpper == "DP");
    
    if (!isMotorCmd) {
      unsigned long agora = millis();
      if (cmdUpper == ultimoCmdBLE && (agora - ultimoComandoBLE) < 300) {
        Serial.println("[BLE] Comando duplicado ignorado: " + cmdUpper);
        return;
      }
      ultimoCmdBLE = cmdUpper;
      ultimoComandoBLE = agora;
    }
    
    executaComandoBluetooth(cmd, "BLE");
  }
  processaComandosSerialDebug();
#else
  processaComandosSerialDebug();
#endif
}

void executaComandoBluetooth(String cmd, const char* origin) {
  String cmdRaw = cmd;
  cmdRaw.trim();
  cmd = cmdRaw;
  cmd.toUpperCase();
  if (origin && (String(origin) == "BLE" || String(origin) == "MQTT" || String(origin) == "SERIAL")) {
    String cu = cmd;
    bool isMotorCmd = (cu == "SE" || cu == "DE" || cu == "SA" || cu == "DA" || cu == "SP" || cu == "DP");
    if (isMotorCmd || cu == "STOP" || cu == "AT_SEG") {
      ultimoComandoRemoto = millis();
    }
  }
  String logCmd = cmd;
  if (cmd.startsWith("MQTT_PASS=") || cmd.startsWith("MQTT_PASS:")) {
    logCmd = "MQTT_PASS=***";
  }
  if (cmd.startsWith("SUPABASE_KEY=") || cmd.startsWith("SUPABASE_KEY:")) {
    logCmd = "SUPABASE_KEY=***";
  }
  Serial.print("Comando BT recebido: ");
  Serial.println(logCmd);
  mqttPublishTxCmd(cmd, origin);

#if I2C_EARLY_TEST
  if (!(cmd == "I2C_SCAN" || cmd == "PCF8574_PING" || cmd == "PCF8574_TEST")) {
    Serial.println("[I2C_TEST] Comando permitido: I2C_SCAN | PCF8574_PING | PCF8574_TEST");
    return;
  }
#endif

