joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  if (cmd == "LIMITS_ON") {
    ignoreLimitLocks = false;
    ignoreGavetaLock = false;
    Serial.println("[LIMIT] LIMITS_ON");
    enviarBLE("LIMITS:ON");
    return;
  }

  if (cmd == "LIMITS_STATUS") {
    Serial.print("[LIMIT] IGNORE=");
    Serial.println(ignoreLimitLocks ? "1" : "0");
    enviarBLE(String("LIMITS:IGNORE:") + (ignoreLimitLocks ? "1" : "0") + ":GAVETA_IGNORE:" + (ignoreGavetaLock ? "1" : "0"));
    return;
  }

  if (cmd == "OTA_ON") {
    otaEnabled = true;
    otaSavePreferences();
    enviarBLE("OTA:ON");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_ON", false);
    mqttStatusDirty = true;
    return;
  }
  if (cmd == "OTA_OFF") {
    otaEnabled = false;
    otaSavePreferences();
    enviarBLE("OTA:OFF");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_OFF", false);
    mqttStatusDirty = true;
    return;
  }
  if (cmd == "OTA_STATUS") {
    enviarBLE(String("OTA:ENABLED:") + (otaEnabled ? "1" : "0") + ":INTERVAL:" + String(otaIntervalSec) + ":PENDING:" + (otaPendingVersion.length() ? otaPendingVersion : "NA") + ":MANIFEST:" + (otaManifestUrl.length() ? otaManifestUrl : "NA"));
    return;
  }
  if (cmd.startsWith("OTA_MANIFEST=") || cmd.startsWith("OTA_MANIFEST:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    otaManifestUrl = cmdRaw.substring(sep + 1);
    otaManifestUrl.trim();
    otaSavePreferences();
    enviarBLE("OTA_MANIFEST:OK");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_MANIFEST_SET", false);
    return;
  }
  if (cmd.startsWith("OTA_INTERVAL=") || cmd.startsWith("OTA_INTERVAL:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    uint32_t sec = static_cast<uint32_t>(cmdRaw.substring(sep + 1).toInt());
    if (sec < 60) sec = 60;
    otaIntervalSec = sec;
    otaSavePreferences();
    enviarBLE("OTA_INTERVAL:OK");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_INTERVAL_SET", false);
    return;
  }
  if (cmd == "OTA_CHECK") {
    OtaInfo info;
    bool ok = otaFetchManifest(info);
    if (!ok) {
      enviarBLE("OTA:CHECK:FAIL");
      return;
    }
    if (!info.available) {
      enviarBLE("OTA:NO_UPDATE");
      return;
    }
    enviarBLE("OTA:UPDATE:" + info.version);
    otaDownloadAndUpdate(info);
    return;
  }
  if (cmd.startsWith("OTA_APPLY=") || cmd.startsWith("OTA_APPLY:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    String url = cmdRaw.substring(sep + 1);
    url.trim();
    OtaInfo info;
    info.available = true;
    info.mandatory = true;
    info.version = "MANUAL";
    info.url = url;
    info.md5 = "";
    info.size = 0;
    enviarBLE("OTA:APPLY");
    otaDownloadAndUpdate(info);
    return;
  }

  if (cmd == "BUZZER_TEST_ON") {
    buzzerTestEnabled = true;
    Serial.println("[BUZZER] TEST_ON");
    return;
  }
  if (cmd == "BUZZER_TEST_OFF") {
    buzzerTestEnabled = false;
    Serial.println("[BUZZER] TEST_OFF");
    return;
  }
  if (cmd == "BUZZER_TEST_STATUS") {
    Serial.print("[BUZZER] TEST=");
    Serial.println(buzzerTestEnabled ? "ON" : "OFF");
    return;
  }

  if (cmd == "TEST_SA") { setOutputPin(Rele_SA, true, "TEST"); delay(500); setOutputPin(Rele_SA, false, "TEST"); return; }
  if (cmd == "TEST_DA") { setOutputPin(Rele_DA, true, "TEST"); delay(500); setOutputPin(Rele_DA, false, "TEST"); return; }
  if (cmd == "TEST_SE") { setOutputPin(Rele_SE, true, "TEST"); delay(500); setOutputPin(Rele_SE, false, "TEST"); return; }
  if (cmd == "TEST_DE") { setOutputPin(Rele_DE, true, "TEST"); delay(500); setOutputPin(Rele_DE, false, "TEST"); return; }
  if (cmd == "TEST_SP") { setOutputPin(Rele_SP, true, "TEST"); delay(500); setOutputPin(Rele_SP, false, "TEST"); return; }
  if (cmd == "TEST_DP") { setOutputPin(Rele_DP, true, "TEST"); delay(500); setOutputPin(Rele_DP, false, "TEST"); return; }
  if (cmd == "TEST_RF") { setOutputPin(Rele_refletor, true, "TEST"); delay(500); setOutputPin(Rele_refletor, false, "TEST"); return; }

  if (cmd == "PCF8574_INT") {
    Serial.print("[PCF8574] INT_PIN=");
    Serial.print(PCF8574_INT_PIN);
    Serial.print(" LEVEL=");
    if (PCF8574_INT_PIN >= 0) {
      Serial.println(digitalRead(static_cast<uint8_t>(PCF8574_INT_PIN)) == HIGH ? "1" : "0");
    } else {
      Serial.println("NA");
    }
    Serial.print("[PCF8574] INT_COUNT=");
    Serial.println(static_cast<uint32_t>(pcf8574InterruptCount));
    Serial.print("[PCF8574] INT_PENDING=");
    Serial.println(pcf8574InterruptPending ? "1" : "0");
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    Serial.print("[PCF8574] IN=0x");
    Serial.println(in, HEX);
    if (pcf8574InterruptPending) {
      pcf8574InterruptPending = false;
    }
    return;
  }

  // ===== COMANDOS WIFI (funcionam mesmo com cadeira bloqueada) =====
  if (cmd == "WIFI_RESET") {
    enviarBLE("WIFI:RESETTING");
    resetaConfiguracoesWifi();
    return;
  }
  
  if (cmd == "WIFI_STATUS") {
    if (WiFi.status() == WL_CONNECTED) {
      enviarBLE("WIFI:CONNECTED:" + WiFi.SSID());
    } else {
      enviarBLE("WIFI:DISCONNECTED");
    }
    return;
  }
  
  if (cmd == "WIFI_IP") {
    if (WiFi.status() == WL_CONNECTED) {
      enviarBLE("WIFI_IP:" + WiFi.localIP().toString());
    } else {
      enviarBLE("WIFI_IP:NONE");
    }
    return;
  }
  
  if (cmd == "WIFI_CONFIG") {
    // Inicia portal de configuraÃ§Ã£o WiFi
    enviarBLE("WIFI:CONFIG_MODE");
    Serial.println("Iniciando portal de configuraÃ§Ã£o WiFi...");
    
    // Desconecta do WiFi atual
    WiFi.disconnect();
    
    // Inicia portal de configuraÃ§Ã£o (bloqueia por atÃ© 3 minutos)
    wifiManager.setConfigPortalTimeout(TIMEOUT_CONFIG_WIFI);
    if (wifiManager.startConfigPortal(NOME_DISPOSITIVO.c_str(), SENHA_AP)) {
      enviarBLE("WIFI:CONFIG_OK");
    } else {
      enviarBLE("WIFI:CONFIG_TIMEOUT");
    }
    return;
  }

  // ===== VERIFICA SE CADEIRA ESTÃ BLOQUEADA =====
  if (!cadeiraHabilitada && cmd != "STATUS" && cmd != "AT_SEG") {
    enviarBLE("ERRO:BLOQUEADA");
    Serial.println("Cadeira bloqueada - comando ignorado");
    return;
  }

  // ===== COMANDOS DE CONTROLE DA CADEIRA =====
  if (cmd == "RF") {
    // Liga/desliga refletor
    estado_r = !estado_r;
    setOutputPin(Rele_refletor, estado_r, "RF");
    enviarBLE(estado_r ? "RF:ON" : "RF:OFF");
    Serial.println("Refletor alternado via BLE");
  }
  else if (cmd == "SE") {
    // Encosto sobe (sentar) - Dead man's switch
    if (ignoreLimitLocks || !trava_bt_SE) {
      ultimoComandoSE = millis();
      if (!estado_se) {
        estado_se = true;
        setOutputPin(Rele_SE, true, "SE");
        faz_bt_seg = 1;
        enviarBLE("SE:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("SE:KEEP"); // Motor já ligado, mantendo
      }
    } else {
      enviarBLE("SE:LIMIT");
    }
  }
  else if (cmd == "DE") {
    // Encosto desce (deitar) - Dead man's switch
    if (ignoreLimitLocks || !trava_bt_DE) {
      ultimoComandoDE = millis();
      if (!estado_de) {
        estado_de = true;
        setOutputPin(Rele_DE, true, "DE");
        faz_bt_seg = 1;
        enviarBLE("DE:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("DE:KEEP");
      }
    } else {
      enviarBLE("DE:LIMIT");
    }
  }
  else if (cmd == "SA") {
    // Assento sobe - Dead man's switch
    if (ignoreLimitLocks || !trava_bt_SA) {
      ultimoComandoSA = millis();
      if (!estado_sa) {
        estado_sa = true;
        setOutputPin(Rele_SA, true, "SA");
        faz_bt_seg = 1;
        enviarBLE("SA:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("SA:KEEP");
      }
    } else {
      enviarBLE("SA:LIMIT");
    }
  }
  else if (cmd == "DA") {
    // Assento desce - Dead man's switch
    if (ignoreLimitLocks || !trava_bt_DA) {
      ultimoComandoDA = millis();
      if (!estado_da) {
        estado_da = true;
        setOutputPin(Rele_DA, true, "DA");
        faz_bt_seg = 1;
        enviarBLE("DA:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("DA:KEEP");
      }
    } else {
      enviarBLE("DA:LIMIT");
    }
  }
  else if (cmd == "SP") {
    // Pernas sobem - Dead man's switch
    if (isGavetaAberta()) {
      Serial.println("[GAVETA] Aberta - bloqueando SP");
      enviarBLE("GAVETA:OPEN");
      enviarBLE("SP:GAVETA");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
      mqttStatusDirty = true;
      return;
    }
    if (ignoreLimitLocks || !trava_bt_SP) {
      ultimoComandoSP = millis();
      if (!estado_sp) {
        estado_sp = true;
        setOutputPin(Rele_SP, true, "SP");
        faz_bt_seg = 1;
        enviarBLE("SP:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("SP:KEEP");
      }
    } else {
      enviarBLE("SP:LIMIT");
    }
  }
  else if (cmd == "DP") {
    // Pernas descem - Dead man's switch
    if (isGavetaAberta()) {
      Serial.println("[GAVETA] Aberta - bloqueando DP");
      enviarBLE("GAVETA:OPEN");
      enviarBLE("DP:GAVETA");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
      mqttStatusDirty = true;
      return;
    }
    if (ignoreLimitLocks || !trava_bt_DP) {
      ultimoComandoDP = millis();
      if (!estado_dp) {
        estado_dp = true;
        setOutputPin(Rele_DP, true, "DP");
        faz_bt_seg = 1;
        enviarBLE("DP:ON");
        iniciaTimerMotor();
      } else {
        enviarBLE("DP:KEEP");
      }
    } else {
      enviarBLE("DP:LIMIT");
    }
  }
  else if (cmd == "TS") {
    if (Rele_TREND_SOBE < 0) {
      enviarBLE("TS:NA");
      return;
    }
    ultimoComandoTrendSobe = millis();
    if (!estado_trend_sobe) {
      estado_trend_sobe = true;
      estado_trend_desce = false;
      if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TS");
      setOutputPin(Rele_TREND_SOBE, true, "TS");
      faz_bt_seg = 1;
      enviarBLE("TS:ON");
      iniciaTimerMotor();
    } else {
      enviarBLE("TS:KEEP");
    }
  }
  else if (cmd == "TD") {
    if (Rele_TREND_DESCE < 0) {
      enviarBLE("TD:NA");
      return;
    }
    bool limitDown = false;
    if (TREN_INT_DESCE >= 0 && digitalRead(TREN_INT_DESCE) == LOW) limitDown = true;
    if (INT_TREND_DESCE >= 0 && digitalRead(INT_TREND_DESCE) == LOW) limitDown = true;
    if (limitDown) {
      enviarBLE("TD:LIMIT");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TD_LIMIT", false);
      mqttStatusDirty = true;
      return;
    }
    ultimoComandoTrendDesce = millis();
    if (!estado_trend_desce) {
      estado_trend_desce = true;
      estado_trend_sobe = false;
      if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TD");
      setOutputPin(Rele_TREND_DESCE, true, "TD");
      faz_bt_seg = 1;
      enviarBLE("TD:ON");
      iniciaTimerMotor();
    } else {
      enviarBLE("TD:KEEP");
    }
  }
  else if (cmd == "VZ") {
    // PosiÃ§Ã£o ginecolÃ³gica
    enviarBLE("VZ:EXEC");
    cont = 1;
    executa_vz();
    enviarBLE("VZ:DONE");
  }
  else if (cmd == "PT") {
    // PosiÃ§Ã£o de parto
    enviarBLE("PT:EXEC");
    cont13 = 1;
    executa_pt();
    enviarBLE("PT:DONE");
  }
  else if (cmd == "M1") {
    // PosiÃ§Ã£o de memÃ³ria 1
    enviarBLE("M1:EXEC");
    executa_M1_bluetooth();
    enviarBLE("M1:DONE");
  }
  else if (cmd == "AT_SEG" || cmd == "STOP") {
    // Parada de emergÃªncia
    AT_SEG();
    paraTimerMotor();
    enviarBLE("AT_SEG:OK");
  }
  else if (cmd == "STATUS") {
    // Retorna status completo
    enviaStatusBluetooth();
  }
  else if (cmd == "HORIMETRO") {
    // Retorna horÃ­metro
    enviarBLE("HORIMETRO:" + String(horimetro, 2));
  }
  else if (cmd == "PING") {
    // Teste de conexÃ£o
    enviarBLE("PONG");
  }
  else if (cmd == "CAL_RESET") {
    resetCalibracao();
    enviarBLE("CAL:RESET");
    supabaseLogUsage("CAL_RESET");
  }
  else if (cmd == "CAL_START") {
    supabaseLogUsage("CAL_START");
    executaCalibracao();
    enviarBLE("CAL:DONE");
    supabaseLogUsage("CAL_DONE");
  }
  else if (cmd == "M1_LOAD_FROM_DB") {
    if (supabaseLoadMemoryPositionFromDb(1)) {
      enviarBLE("M1:DB_LOADED");
    }
  }
  else if (cmd.startsWith("M_LOAD_FROM_DB=") || cmd.startsWith("M_LOAD_FROM_DB:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    int slot = cmd.substring(sep + 1).toInt();
    supabaseLoadMemoryPositionFromDb(slot);
  }
  else if (cmd == "TRAVEL_STATUS") {
    double enc_m = (static_cast<double>(motorTravelPulsesEncosto) * mmPerPulseEncosto) / 1000.0;
    double ass_m = (static_cast<double>(motorTravelPulsesAssento) * mmPerPulseAssento) / 1000.0;
    double per_m = (static_cast<double>(motorTravelPulsesPerneira) * mmPerPulsePerneira) / 1000.0;
    Serial.print("[TRAVEL] PULSOS ENC=");
    Serial.print(static_cast<uint32_t>(motorTravelPulsesEncosto));
    Serial.print(" ASS=");
    Serial.print(static_cast<uint32_t>(motorTravelPulsesAssento));
    Serial.print(" PER=");
    Serial.println(static_cast<uint32_t>(motorTravelPulsesPerneira));
    Serial.print("[TRAVEL] METROS ENC=");
    Serial.print(enc_m, 3);
    Serial.print(" ASS=");
    Serial.print(ass_m, 3);
    Serial.print(" PER=");
    Serial.println(per_m, 3);
    enviarBLE("TRAVEL:OK");
  }
  else if (cmd == "TRAVEL_RESET") {
    motorTravelPulsesEncosto = 0;
    motorTravelPulsesAssento = 0;
    motorTravelPulsesPerneira = 0;
    motorTravelUnsavedEncosto = 0;
    motorTravelUnsavedAssento = 0;
    motorTravelUnsavedPerneira = 0;
    saveMotorTravelPreferences(true);
    supabaseLogUsage("TRAVEL_RESET");
    enviarBLE("TRAVEL:RESET");
  }
  else if (cmd == "TRAVEL_SEND") {
    saveMotorTravelPreferences(true);
    if (supabaseUpsertMotorTravel()) {
      supabaseLogUsage("MOTOR_TRAVEL_SENT");
      enviarBLE("TRAVEL:SENT");
    } else {
      enviarBLE("TRAVEL:SENT_FAIL");
    }
  }
  else if (cmd.startsWith("MM_PER_PULSE_ENC=") || cmd.startsWith("MM_PER_PULSE_ENC:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    mmPerPulseEncosto = cmd.substring(sep + 1).toFloat();
    saveMotorTravelPreferences(true);
    enviarBLE("MM_PER_PULSE_ENC:OK");
  }
  else if (cmd.startsWith("MM_PER_PULSE_ASS=") || cmd.startsWith("MM_PER_PULSE_ASS:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    mmPerPulseAssento = cmd.substring(sep + 1).toFloat();
    saveMotorTravelPreferences(true);
    enviarBLE("MM_PER_PULSE_ASS:OK");
  }
  else if (cmd.startsWith("MM_PER_PULSE_PER=") || cmd.startsWith("MM_PER_PULSE_PER:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    mmPerPulsePerneira = cmd.substring(sep + 1).toFloat();
    saveMotorTravelPreferences(true);
    enviarBLE("MM_PER_PULSE_PER:OK");
  }
  else if (cmd == "ENC_DEBUG_ON") {
    encoderPulseDebug = true;
    enviarBLE("ENC_DEBUG:ON");
  }
  else if (cmd == "ENC_DEBUG_OFF") {
    encoderPulseDebug = false;
    enviarBLE("ENC_DEBUG:OFF");
  }
  else {
    enviarBLE("ERRO:CMD_INVALIDO");
  }
}

// Envia status completo via BLE em formato JSON
void enviaStatusBluetooth() {
  StaticJsonDocument<640> doc;
  
  doc["serial"] = NUMERO_SERIE_CADEIRA;
  doc["habilitada"] = cadeiraHabilitada;
  doc["manutencao"] = manutencaoNecessaria;
  doc["horimetro"] = horimetro;
  doc["wifi"] = WiFi.isConnected();
  doc["wifi_ssid"] = WiFi.isConnected() ? WiFi.SSID() : "";
  
  // Estados dos relÃ©s
  doc["refletor"] = estado_r;
  doc["encosto_pos"] = incoder_virtual_encosto_service;
  doc["assento_pos"] = incoder_virtual_asento_service;
  doc["perneira_pos"] = incoder_virtual_perneira_service;
  doc["gaveta_open"] = isGavetaAbertaRaw();
  doc["trend_sobe_on"] = estado_trend_sobe;
  doc["trend_desce_on"] = estado_trend_desce;
  if (TREN_INT_DESCE >= 0) doc["tren_int_desce"] = (digitalRead(TREN_INT_DESCE) == LOW);
  if (INT_TREND_DESCE >= 0) doc["int_trend_desce"] = (digitalRead(INT_TREND_DESCE) == LOW);
  
  // Limites
  doc["se_limit"] = trava_bt_SE;
  doc["de_limit"] = trava_bt_DE;
  doc["sa_limit"] = trava_bt_SA;
  doc["da_limit"] = trava_bt_DA;
  doc["sp_limit"] = trava_bt_SP;
  doc["dp_limit"] = trava_bt_DP;

  String output;
  serializeJson(doc, output);
  enviarBLE("STATUS:" + output);
}

// ========== HORÃMETRO ==========
void iniciaTimerMotor() {
  if (!motorLigado) {
    tempoInicioMotor = millis();
    motorLigado = true;
  }
}

void paraTimerMotor() {
  if (motorLigado) {
    totalMillisMotor += (millis() - tempoInicioMotor);
    motorLigado = false;
    
    // Converte para horas e salva
    horimetro = totalMillisMotor / 3600000.0;
    salvaHorimetro();
  }
}

