joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  int httpCode = http.POST(payload);
  bool ok = (httpCode == 201 || httpCode == 204);
  if (!ok && httpCode > 0) {
    Serial.print("[ERRO] Supabase POST ");
    Serial.print(restPath);
    Serial.print(" ");
    Serial.print(httpCode);
    Serial.print(" ");
    Serial.println(http.getString());
  }
  http.end();
  return ok;
}

static bool supabaseGetJson(const String& restPath, String& responseOut) {
  if (WiFi.status() != WL_CONNECTED) return false;
  if (ESP.getFreeHeap() < 30000) return false;

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  String url = supabaseUrl + restPath;
  if (!http.begin(client, url)) {
    return false;
  }

  http.setTimeout(10000);
  if (supabaseKey.length() > 0) {
    http.addHeader("apikey", supabaseKey);
    http.addHeader("Authorization", String("Bearer ") + supabaseKey);
  }

  int httpCode = http.GET();
  if (httpCode == 200) {
    responseOut = http.getString();
    http.end();
    return true;
  }

  if (httpCode > 0) {
    Serial.print("[ERRO] Supabase GET ");
    Serial.print(restPath);
    Serial.print(" ");
    Serial.print(httpCode);
    Serial.print(" ");
    Serial.println(http.getString());
  }
  http.end();
  return false;
}

static void loadMotorTravelPreferences() {
  Preferences p;
  if (!p.begin("motor_travel", true)) {
    return;
  }
  motorTravelPulsesEncosto = p.getULong64("p_enc", 0);
  motorTravelPulsesAssento = p.getULong64("p_ass", 0);
  motorTravelPulsesPerneira = p.getULong64("p_per", 0);
  mmPerPulseEncosto = p.getFloat("mm_enc", mmPerPulseEncosto);
  mmPerPulseAssento = p.getFloat("mm_ass", mmPerPulseAssento);
  mmPerPulsePerneira = p.getFloat("mm_per", mmPerPulsePerneira);
  p.end();
  Serial.print("[TRAVEL] PULSOS ENC=");
  Serial.print(static_cast<uint32_t>(motorTravelPulsesEncosto));
  Serial.print(" ASS=");
  Serial.print(static_cast<uint32_t>(motorTravelPulsesAssento));
  Serial.print(" PER=");
  Serial.println(static_cast<uint32_t>(motorTravelPulsesPerneira));
  Serial.print("[TRAVEL] MM_PER_PULSE ENC=");
  Serial.print(mmPerPulseEncosto, 6);
  Serial.print(" ASS=");
  Serial.print(mmPerPulseAssento, 6);
  Serial.print(" PER=");
  Serial.println(mmPerPulsePerneira, 6);
}

static void saveMotorTravelPreferences(bool force) {
  uint32_t now = millis();
  if (!force) {
    if (motorTravelUnsavedEncosto == 0 && motorTravelUnsavedAssento == 0 && motorTravelUnsavedPerneira == 0) {
      return;
    }
    if (static_cast<int32_t>(now - motorTravelNextSaveMs) < 0) {
      return;
    }
  }

  Preferences p;
  if (!p.begin("motor_travel", false)) {
    motorTravelNextSaveMs = now + MOTOR_TRAVEL_SAVE_INTERVAL_MS;
    return;
  }
  p.putULong64("p_enc", motorTravelPulsesEncosto);
  p.putULong64("p_ass", motorTravelPulsesAssento);
  p.putULong64("p_per", motorTravelPulsesPerneira);
  p.putFloat("mm_enc", mmPerPulseEncosto);
  p.putFloat("mm_ass", mmPerPulseAssento);
  p.putFloat("mm_per", mmPerPulsePerneira);
  p.end();
  motorTravelUnsavedEncosto = 0;
  motorTravelUnsavedAssento = 0;
  motorTravelUnsavedPerneira = 0;
  motorTravelNextSaveMs = now + MOTOR_TRAVEL_SAVE_INTERVAL_MS;
}

static bool supabaseUpsertMotorTravel() {
  if (WiFi.status() != WL_CONNECTED) return false;
  if (ESP.getFreeHeap() < 30000) return false;

  double enc_m = (static_cast<double>(motorTravelPulsesEncosto) * mmPerPulseEncosto) / 1000.0;
  double ass_m = (static_cast<double>(motorTravelPulsesAssento) * mmPerPulseAssento) / 1000.0;
  double per_m = (static_cast<double>(motorTravelPulsesPerneira) * mmPerPulsePerneira) / 1000.0;

  StaticJsonDocument<512> doc;
  doc["chair_serial"] = NUMERO_SERIE_CADEIRA;
  doc["encosto_pulses"] = static_cast<double>(motorTravelPulsesEncosto);
  doc["assento_pulses"] = static_cast<double>(motorTravelPulsesAssento);
  doc["perneira_pulses"] = static_cast<double>(motorTravelPulsesPerneira);
  doc["encosto_m"] = enc_m;
  doc["assento_m"] = ass_m;
  doc["perneira_m"] = per_m;
  doc["mm_per_pulse_encosto"] = mmPerPulseEncosto;
  doc["mm_per_pulse_assento"] = mmPerPulseAssento;
  doc["mm_per_pulse_perneira"] = mmPerPulsePerneira;
  doc["updated_at"] = getTimestamp();

  String payload;
  serializeJson(doc, payload);

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  String url = supabaseUrl + "/rest/v1/chair_motor_travel?on_conflict=chair_serial";
  if (!http.begin(client, url)) {
    return false;
  }
  http.setTimeout(10000);
  http.addHeader("Content-Type", "application/json");
  if (supabaseKey.length() > 0) {
    http.addHeader("apikey", supabaseKey);
    http.addHeader("Authorization", String("Bearer ") + supabaseKey);
  }
  http.addHeader("Prefer", "resolution=merge-duplicates,return=minimal");
  int httpCode = http.POST(payload);
  bool ok = (httpCode == 201 || httpCode == 204);
  if (!ok && httpCode > 0) {
    Serial.print("[ERRO] MotorTravel ");
    Serial.print(httpCode);
    Serial.print(" ");
    Serial.println(http.getString());
  }
  http.end();
  return ok;
}

static void sendMotorTravelToSupabaseIfNeeded() {
  uint32_t now = millis();
  if (static_cast<int32_t>(now - motorTravelNextSendMs) < 0) {
    return;
  }
  motorTravelNextSendMs = now + MOTOR_TRAVEL_SEND_INTERVAL_MS;
  saveMotorTravelPreferences(true);
  if (supabaseUpsertMotorTravel()) {
    supabaseLogUsage("MOTOR_TRAVEL_SENT");
  }
}

static bool supabaseLoadMemoryPositionFromDb(int slot) {
  if (slot < 1 || slot > 10) {
    return false;
  }
  String user = supabaseUserId.length() > 0 ? supabaseUserId : NUMERO_SERIE_CADEIRA;
  String path = "/rest/v1/memory_positions?user_id=eq." + user +
                "&slot=eq." + String(slot) +
                "&select=back_angle,seat_height,leg_rest_angle,updated_at" +
                "&order=updated_at.desc&limit=1";

  String response;
  if (!supabaseGetJson(path, response)) {
    enviarBLE("M:DB_LOAD:ERR");
    return false;
  }
  if (response == "[]") {
    Serial.println("[M] DB vazio para esse user/slot");
    enviarBLE("M:DB_LOAD:EMPTY");
    return false;
  }

