joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  StaticJsonDocument<512> doc;
  DeserializationError error = deserializeJson(doc, response);
  if (error || !doc.is<JsonArray>() || doc.size() == 0) {
    Serial.println("[M] ERRO JSON memory_positions");
    enviarBLE("M:DB_LOAD:JSON_ERR");
    return false;
  }

  float back = doc[0]["back_angle"] | 0.0f;
  float seat = doc[0]["seat_height"] | 0.0f;
  float leg = doc[0]["leg_rest_angle"] | 0.0f;

  int prevEnc = incoder_virtual_encosto_M1;
  int prevAss = incoder_virtual_asento_M1;
  int prevPer = incoder_virtual_perneira_M1;

  incoder_virtual_encosto_M1 = static_cast<int>(back);
  incoder_virtual_asento_M1 = static_cast<int>(seat);
  incoder_virtual_perneira_M1 = static_cast<int>(leg);

  preferences.begin("encoder_encosto", false);
  preferences.putInt("encoder_encosto", incoder_virtual_encosto_M1);
  preferences.end();

  preferences.begin("encoder_asento", false);
  preferences.putInt("encoder_asento", incoder_virtual_asento_M1);
  preferences.end();

  preferences.begin("encoder_perneira", false);
  preferences.putInt("encoder_perneira", incoder_virtual_perneira_M1);
  preferences.end();

  Serial.print("[M] DB->M");
  Serial.print(slot);
  Serial.print(" ENC ");
  Serial.print(prevEnc);
  Serial.print("->");
  Serial.print(incoder_virtual_encosto_M1);
  Serial.print(" ASS ");
  Serial.print(prevAss);
  Serial.print("->");
  Serial.print(incoder_virtual_asento_M1);
  Serial.print(" PER ");
  Serial.print(prevPer);
  Serial.print("->");
  Serial.println(incoder_virtual_perneira_M1);

  enviarBLE(String("M:DB_LOADED:") + slot);
  supabaseLogUsage("MEMORY_POSITION_LOADED");
  return true;
}

static void supabaseLogUsage(const char* action) {
  StaticJsonDocument<512> doc;
  doc["action"] = action;
  doc["device_id"] = NUMERO_SERIE_CADEIRA;
  String ts = getTimestamp();
  if (ts.length() > 0 && ts != "null") {
    doc["created_at"] = ts;
  }
  if (supabaseUserId.length() > 0) {
    doc["user_id"] = supabaseUserId;
  }
  JsonObject meta = doc.createNestedObject("metadata");
  meta["heap"] = ESP.getFreeHeap();
  meta["rssi"] = WiFi.isConnected() ? WiFi.RSSI() : 0;
  String payload;
  serializeJson(doc, payload);
  supabasePostJson("/rest/v1/chair_usage_logs", payload);
}

static void supabaseCreateMaintenanceRequestIfNeeded() {
  if (!manutencaoNecessaria) return;
  if (supabaseMaintenanceRequestSent) return;

  StaticJsonDocument<384> doc;
  doc["chair_serial"] = NUMERO_SERIE_CADEIRA;
  doc["description"] = "Manutencao requerida";
  doc["hours_at_request"] = horimetro;
  String ts = getTimestamp();
  if (ts.length() > 0 && ts != "null") {
    doc["created_at"] = ts;
  }

  String payload;
  serializeJson(doc, payload);
  if (supabasePostJson("/rest/v1/maintenance_requests", payload)) {
    supabaseMaintenanceRequestSent = true;
    preferences.begin("cadeira", false);
    preferences.putBool("mnt_sent", true);
    preferences.end();
    supabaseLogUsage("MAINTENANCE_REQUEST_CREATED");
  }
}

static void supabaseSaveMemoryPosition(int slot) {
  if (slot < 1 || slot > 10) return;
  StaticJsonDocument<384> doc;
  String user = supabaseUserId.length() > 0 ? supabaseUserId : NUMERO_SERIE_CADEIRA;
  doc["user_id"] = user;
  doc["slot"] = slot;
  doc["back_angle"] = incoder_virtual_encosto_service;
  doc["seat_height"] = incoder_virtual_asento_service;
  doc["leg_rest_angle"] = incoder_virtual_perneira_service;
  String ts = getTimestamp();
  if (ts.length() > 0 && ts != "null") {
    doc["created_at"] = ts;
    doc["updated_at"] = ts;
  }

  String payload;
  serializeJson(doc, payload);
  if (supabasePostJson("/rest/v1/memory_positions", payload)) {
    supabaseLogUsage("MEMORY_POSITION_SAVED");
  }
}

void verificaStatusCadeira() {
  if (WiFi.status() != WL_CONNECTED) return;
  
  // Verifica se hÃ¡ memÃ³ria suficiente antes de tentar SSL
  size_t freeHeap = ESP.getFreeHeap();
  Serial.print("[DEBUG] Heap disponivel: ");
  Serial.print(freeHeap);
  Serial.println(" bytes");
  
  if (freeHeap < 30000) {
    Serial.println("[AVISO] Memoria insuficiente para SSL (< 30KB), pulando verificacao.");
    Serial.println("[INFO] Cadeira operara em modo offline ate proxima verificacao.");
    return;
  }
  
  Serial.println("Verificando status da cadeira no Supabase...");
  WiFiClientSecure client;
  client.setInsecure();
  
  HTTPClient http;
  String url = supabaseUrl + "/rest/v1/chairs?serial_number=eq." + NUMERO_SERIE_CADEIRA + "&select=enabled,maintenance_required,maintenance_hours";
  
  if (http.begin(client, url)) {
    http.setTimeout(10000); // 10s timeout
    if (supabaseKey.length() > 0) {
      http.addHeader("apikey", supabaseKey);
      http.addHeader("Authorization", String("Bearer ") + supabaseKey);
    }
    
    int httpCode = http.GET();
    Serial.print("HTTP Code: "); Serial.println(httpCode);
    
    if (httpCode == 200) {
      String response = http.getString();
      Serial.print("Resposta: "); Serial.println(response);
      
      if (response == "[]") {
        Serial.println("Cadeira nao encontrada (lista vazia), registrando...");
        registraCadeiraNoSupabase();
      } else {
        // Usa StaticJsonDocument para evitar fragmentaÃ§Ã£o de heap
        StaticJsonDocument<768> doc;
        DeserializationError error = deserializeJson(doc, response);
        
        if (!error) {
          if (doc.is<JsonArray>() && doc.size() > 0) {
            cadeiraHabilitada = doc[0]["enabled"] | true;
            manutencaoNecessaria = doc[0]["maintenance_required"] | false;
            float horasManutencao = doc[0]["maintenance_hours"] | 500;
            
            if (horimetro >= horasManutencao) {
              manutencaoNecessaria = true;
            }
            
            Serial.print("Status: habilitada=");
            Serial.print(cadeiraHabilitada ? "SIM" : "NAO");
            Serial.print(", manutencao=");
            Serial.println(manutencaoNecessaria ? "SIM" : "NAO");

            if (!manutencaoNecessaria && supabaseMaintenanceRequestSent) {
              supabaseMaintenanceRequestSent = false;
              preferences.begin("cadeira", false);
              preferences.putBool("mnt_sent", false);
              preferences.end();
            }
            supabaseCreateMaintenanceRequestIfNeeded();
            
            if (!cadeiraHabilitada) {
              AT_SEG();
              Serial.println("!!! CADEIRA BLOQUEADA REMOTAMENTE !!!");
              bipBloqueio();
            }
          } else {
            Serial.println("Erro: Resposta do Supabase nao e um array valido ou esta vazia");
          }
        } else {
          Serial.print("Erro ao processar JSON: ");
          Serial.println(error.c_str());
        }
      }
    } else {
      Serial.print("Erro HTTP: "); Serial.println(httpCode);
    }
    http.end();
  } else {
    Serial.println("Falha ao iniciar conexao HTTP");
  }
}

void sincronizaNTP() {
  Serial.println("[NTP] Sincronizando horario com servidor NTP...");
  // Configura NTP para horário de Brasília (GMT-3)
  configTime(-3 * 3600, 0, "pool.ntp.org", "time.nist.gov");
  
  Serial.print("[NTP] Aguardando sincronizacao");
  int tentativas = 0;
  while (time(nullptr) < 100000 && tentativas < 20) {
    Serial.print(".");
    delay(500);
    tentativas++;
  }
  
  if (time(nullptr) < 100000) {
    Serial.println("\n[ERRO] Falha ao sincronizar NTP");
  } else {
    time_t now = time(nullptr);
    Serial.println("\n[OK] Horario sincronizado!");
    Serial.print("[NTP] Data/Hora atual: ");
    Serial.println(ctime(&now));
  }
}

