joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
String getTimestamp() {
  // Retorna timestamp ISO 8601 (formato aceito pelo Supabase)
  time_t now = time(nullptr);
  struct tm timeinfo;
  
  if (!getLocalTime(&timeinfo)) {
    // Se NTP falhou, retorna NULL para Supabase usar horário do servidor
    return "null";
  }
  
  char buffer[30];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%S-03:00", &timeinfo);
  return String(buffer);
}

void bipBloqueio() {
  for (int i = 0; i < 5; i++) {
    bip();
    delay(200);
  }
}

// ========== CARREGAMENTO DE PREFERÃŠNCIAS ==========
void carregaPreferencias() {
  preferences.begin("cadeira", true);
  supabaseUserId = preferences.getString("user_id", "");
  supabaseMaintenanceRequestSent = preferences.getBool("mnt_sent", false);
  preferences.end();

  preferences.begin("supabase", true);
  supabaseUrl = preferences.getString("url", SUPABASE_URL);
  supabaseKey = preferences.getString("key", "");
  preferences.end();

  // Carrega posiÃ§Ãµes do encoder virtual M1
  preferences.begin("encoder_encosto", true);
  incoder_virtual_encosto_M1 = preferences.getInt("encoder_encosto", 0);
  preferences.end();
  
  preferences.begin("encoder_asento", true);
  incoder_virtual_asento_M1 = preferences.getInt("encoder_asento", 0);
  preferences.end();
  
  preferences.begin("encoder_perneira", true);
  incoder_virtual_perneira_M1 = preferences.getInt("encoder_perneira", 0);
  preferences.end();

  // Carrega horÃ­metro
  carregaHorimetro();

  Serial.print("Encoder encosto M1: ");
  Serial.println(incoder_virtual_encosto_M1);
  Serial.print("Encoder assento M1: ");
  Serial.println(incoder_virtual_asento_M1);
  Serial.print("Encoder perneira M1: ");
  Serial.println(incoder_virtual_perneira_M1);
}

// ========== EXECUÃ‡ÃƒO M1 VIA BLUETOOTH (sem esperar botÃ£o fÃ­sico) ==========
void executa_M1_bluetooth() {
  bip();
  
  Serial.println("Executando Memoria 1 via Bluetooth");
  faz_bt_seg = 1;
  
  while (true) {
    Watch_Dog();
    
    // Verifica parada de emergÃªncia via BLE
    if (comandoBLE.length() > 0) {
      String cmd = comandoBLE;
      comandoBLE = "";
      cmd.trim();
      cmd.toUpperCase();
      if (cmd == "AT_SEG" || cmd == "STOP") {
        AT_SEG();
        return;
      }
    }
    
    // Movimento do encosto
    if (incoder_virtual_encosto_service > incoder_virtual_encosto_M1) {
      setOutputPin(Rele_DE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service--;
      Serial.print("Encosto posicao: ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_DE, false, "M1");
      en_DE_acabou = true;
    }

    if (incoder_virtual_encosto_service < incoder_virtual_encosto_M1) {
      setOutputPin(Rele_SE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service++;
      Serial.print("Encosto posicao: ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_SE, false, "M1");
      en_SE_acabou = true;
    }

    // Movimento do assento
    if (incoder_virtual_asento_service > incoder_virtual_asento_M1) {
      setOutputPin(Rele_DA, true, "M1");
      delay(250);
      incoder_virtual_asento_service--;
      Serial.print("Assento posicao: ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_DA, false, "M1");
      en_DA_acabou = true;
    }

    if (incoder_virtual_asento_service < incoder_virtual_asento_M1) {
      setOutputPin(Rele_SA, true, "M1");
      delay(250);
      incoder_virtual_asento_service++;
      Serial.print("Assento posicao: ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_SA, false, "M1");
      en_SA_acabou = true;
    }

    // Movimento da perneira
    if (incoder_virtual_perneira_service > incoder_virtual_perneira_M1) {
      setOutputPin(Rele_DP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service--;
      Serial.print("Perneira posicao: ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_DP, false, "M1");
      en_DP_acabou = true;
    }

    if (incoder_virtual_perneira_service < incoder_virtual_perneira_M1) {
      setOutputPin(Rele_SP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service++;
      Serial.print("Perneira posicao: ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_SP, false, "M1");
      en_SP_acabou = true;
    }

    // Verifica se todos os movimentos terminaram
    if (en_SE_acabou && en_DE_acabou && en_SA_acabou && en_DA_acabou && en_SP_acabou && en_DP_acabou) {
      en_SP_acabou = false;
      en_DP_acabou = false;
      en_SE_acabou = false;
      en_DE_acabou = false;
      en_SA_acabou = false;
      en_DA_acabou = false;
      
      faz_bt_seg = 0;
      bip();
      delay(300);
      bip();
      
      Serial.println("Memoria 1 concluida");
      return;
    }
  }
}

// ========== FUNÃ‡Ã•ES DO ENCODER VIRTUAL ==========
void contagem_tempo_incoder_virtual() {
  bool dir_encosto_up = (digitalRead(Rele_DE) == HIGH);
  bool dir_encosto_down = (digitalRead(Rele_SE) == HIGH);
  bool dir_asento_up = (digitalRead(Rele_SA) == HIGH);
  bool dir_asento_down = (digitalRead(Rele_DA) == HIGH);
  bool dir_perneira_up = (digitalRead(Rele_SP) == HIGH);
  bool dir_perneira_down = (digitalRead(Rele_DP) == HIGH);

  uint32_t d_encosto = pulses_encosto - last_pulses_encosto;
  uint32_t d_asento = pulses_assento - last_pulses_assento;
  uint32_t d_perneira = pulses_perneira - last_pulses_perneira;
  last_pulses_encosto = pulses_encosto;
  last_pulses_assento = pulses_assento;
  last_pulses_perneira = pulses_perneira;

  if (d_encosto) {
    motorTravelPulsesEncosto += d_encosto;
    motorTravelUnsavedEncosto += d_encosto;
  }
  if (d_asento) {
    motorTravelPulsesAssento += d_asento;
    motorTravelUnsavedAssento += d_asento;
  }
  if (d_perneira) {
    motorTravelPulsesPerneira += d_perneira;
    motorTravelUnsavedPerneira += d_perneira;
  }
  if (encoderPulseDebug && (d_encosto || d_asento || d_perneira)) {
    Serial.print("[ENC_PULSE] dENC=");
    Serial.print(d_encosto);
    Serial.print(" dASS=");
    Serial.print(d_asento);
    Serial.print(" dPER=");
    Serial.print(d_perneira);
    Serial.print(" | PENC=");
    Serial.print(static_cast<uint32_t>(pulses_encosto));
    Serial.print(" PASS=");
    Serial.print(static_cast<uint32_t>(pulses_assento));
    Serial.print(" PPER=");
    Serial.println(static_cast<uint32_t>(pulses_perneira));
  }
  saveMotorTravelPreferences(false);

  if (d_encosto) {
    if (dir_encosto_up) {
      if (calibrationInProgress || incoder_virtual_encosto_service + (int)d_encosto <= fim_encosto_encoder) {
        incoder_virtual_encosto_service += (int)d_encosto;
        trava_bt_SE = false;
      } else {
        incoder_virtual_encosto_service = fim_encosto_encoder;
        setOutputPin(Rele_DE, false, "LIMIT");
        trava_bt_DE = true;
      }
    } else if (dir_encosto_down) {
      if (incoder_virtual_encosto_service - (int)d_encosto >= 0) {
        incoder_virtual_encosto_service -= (int)d_encosto;
        trava_bt_DE = false;
      } else {
        incoder_virtual_encosto_service = 0;
        setOutputPin(Rele_SE, false, "LIMIT");
        trava_bt_SE = true;
      }
    }
  }

  if (d_asento) {
    if (dir_asento_up) {
      if (calibrationInProgress || incoder_virtual_asento_service + (int)d_asento <= fim_asento_encoder) {
        incoder_virtual_asento_service += (int)d_asento;
        trava_bt_DA = false; trava_bt_SA = false;
      } else {
        incoder_virtual_asento_service = fim_asento_encoder;
        setOutputPin(Rele_SA, false, "LIMIT");
        trava_bt_SA = true;
      }
    } else if (dir_asento_down) {
      if (incoder_virtual_asento_service - (int)d_asento >= 0) {
        incoder_virtual_asento_service -= (int)d_asento;
        trava_bt_SA = false; trava_bt_DA = false;
      } else {
        incoder_virtual_asento_service = 0;
        setOutputPin(Rele_DA, false, "LIMIT");
        trava_bt_DA = true;
      }
    }
  }

  if (d_perneira) {
    if (dir_perneira_up) {
      if (calibrationInProgress || incoder_virtual_perneira_service + (int)d_perneira <= fim_perneira_encoder) {
        incoder_virtual_perneira_service += (int)d_perneira;
        trava_bt_DP = false; trava_bt_SP = false;
      } else {
        incoder_virtual_perneira_service = fim_perneira_encoder;
        setOutputPin(Rele_SP, false, "LIMIT");
        trava_bt_SP = true;
      }
    } else if (dir_perneira_down) {
      if (incoder_virtual_perneira_service - (int)d_perneira >= 0) {
        incoder_virtual_perneira_service -= (int)d_perneira;
        trava_bt_SP = false; trava_bt_DP = false;
      } else {
        incoder_virtual_perneira_service = 0;
        setOutputPin(Rele_DP, false, "LIMIT");
        trava_bt_DP = true;
      }
    }
  }
}

// ========== WATCH DOG (LED heartbeat) ==========
void Watch_Dog() {
  unsigned long agora = millis();
  if (agora - ultimoMillisPiscaLed > 500) {
    ultimoMillisPiscaLed = agora;
    estadoLedPisca = !estadoLedPisca;
    digitalWrite(LED, estadoLedPisca ? HIGH : LOW);
  }
}

unsigned long inicioAtivacaoRele = 0;
const unsigned long TIMEOUT_RELE = 30000; // 30 segundos

// ========== MONITORAMENTO DE TEMPO DOS RELÃ‰S (seguranÃ§a) ==========
void monitora_tempo_rele() {
  if (isGavetaAberta()) {
    bool spOn = (digitalRead(Rele_SP) == HIGH);
    bool dpOn = (digitalRead(Rele_DP) == HIGH);
    if (spOn || dpOn) {
      Serial.println("[GAVETA] Aberta - desligando perneira");
      setOutputPin(Rele_SP, false, "GAVETA");
      setOutputPin(Rele_DP, false, "GAVETA");
      estado_sp = false;
      estado_dp = false;
      enviarBLE("GAVETA:OPEN");
      enviarBLE("SP:GAVETA");
      enviarBLE("DP:GAVETA");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
    }
  }

