joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  bool algumReleAtivo = (digitalRead(Rele_SE) == HIGH || 
                         digitalRead(Rele_SA) == HIGH || 
                         digitalRead(Rele_DA) == HIGH || 
                         digitalRead(Rele_SP) == HIGH || 
                         digitalRead(Rele_DP) == HIGH || 
                         digitalRead(Rele_DE) == HIGH ||
                         (Rele_TREND_SOBE >= 0 && digitalRead(Rele_TREND_SOBE) == HIGH) ||
                         (Rele_TREND_DESCE >= 0 && digitalRead(Rele_TREND_DESCE) == HIGH));

  if (algumReleAtivo) {
    if (inicioAtivacaoRele == 0) {
      inicioAtivacaoRele = millis();
    } else if (millis() - inicioAtivacaoRele >= TIMEOUT_RELE) {
      Serial.println("!!! TIMEOUT DE SEGURANÃ‡A - RELÃ‰ ATIVO POR 30s !!!");
      AT_SEG();
      inicioAtivacaoRele = 0;
    }
  } else {
    inicioAtivacaoRele = 0;
  }
}

// ========== BOTÃƒO DE SEGURANÃ‡A (parada de emergÃªncia) ==========
void Button_Seg() {
  if (cont == 0 && cont13 == 0 && !faz_m1 && !vzInicialEmAndamento) {
    return;
  }
  buttonState = digitalRead(DE);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(SE);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(DA);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(SA);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(VZ);
  if (buttonState == LOW) { AT_SEG(); }

  // Nota: RF nÃ£o chama AT_SEG pois Ã© usado para reset WiFi
  // buttonState = digitalRead(RF);
  // if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(SP);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(DP);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(PT);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(M1);
  if (buttonState == LOW) { AT_SEG(); }
}

// VariÃ¡veis para detecÃ§Ã£o de borda de subida nos botÃµes
static const uint32_t BUTTON_DEBOUNCE_MS = 40;
bool lastButtonState_RF = HIGH;
bool lastButtonState_SP = HIGH;
bool lastButtonState_DP = HIGH;
bool lastButtonState_DE = HIGH;
bool lastButtonState_SE = HIGH;
bool lastButtonState_SA = HIGH;
bool lastButtonState_DA = HIGH;
bool lastButtonState_GAVETA = HIGH;
bool lastButtonState_VZ = HIGH;
bool lastButtonState_M1 = HIGH;
bool lastButtonState_PT = HIGH;

bool rawButtonState_RF = HIGH;
bool rawButtonState_SP = HIGH;
bool rawButtonState_DP = HIGH;
bool rawButtonState_DE = HIGH;
bool rawButtonState_SE = HIGH;
bool rawButtonState_SA = HIGH;
bool rawButtonState_DA = HIGH;
bool rawButtonState_GAVETA = HIGH;
bool rawButtonState_VZ = HIGH;
bool rawButtonState_M1 = HIGH;
bool rawButtonState_PT = HIGH;

uint32_t rawButtonChangedAt_RF = 0;
uint32_t rawButtonChangedAt_SP = 0;
uint32_t rawButtonChangedAt_DP = 0;
uint32_t rawButtonChangedAt_DE = 0;
uint32_t rawButtonChangedAt_SE = 0;
uint32_t rawButtonChangedAt_SA = 0;
uint32_t rawButtonChangedAt_DA = 0;
uint32_t rawButtonChangedAt_GAVETA = 0;
uint32_t rawButtonChangedAt_VZ = 0;
uint32_t rawButtonChangedAt_M1 = 0;
uint32_t rawButtonChangedAt_PT = 0;

static void inicializaEstadosDeBordaBotoes() {
  uint32_t now = millis();
  lastButtonState_RF = digitalRead(RF);
  lastButtonState_SP = digitalRead(SP);
  lastButtonState_DP = digitalRead(DP);
  lastButtonState_DE = digitalRead(DE);
  lastButtonState_SE = digitalRead(SE);
  lastButtonState_SA = digitalRead(SA);
  lastButtonState_DA = digitalRead(DA);
  lastButtonState_GAVETA = digitalRead(GAVETA);
  lastButtonState_VZ = digitalRead(VZ);
  lastButtonState_M1 = digitalRead(M1);
  lastButtonState_PT = digitalRead(PT);

  rawButtonState_RF = lastButtonState_RF; rawButtonChangedAt_RF = now;
  rawButtonState_SP = lastButtonState_SP; rawButtonChangedAt_SP = now;
  rawButtonState_DP = lastButtonState_DP; rawButtonChangedAt_DP = now;
  rawButtonState_DE = lastButtonState_DE; rawButtonChangedAt_DE = now;
  rawButtonState_SE = lastButtonState_SE; rawButtonChangedAt_SE = now;
  rawButtonState_SA = lastButtonState_SA; rawButtonChangedAt_SA = now;
  rawButtonState_DA = lastButtonState_DA; rawButtonChangedAt_DA = now;
  rawButtonState_GAVETA = lastButtonState_GAVETA; rawButtonChangedAt_GAVETA = now;
  rawButtonState_VZ = lastButtonState_VZ; rawButtonChangedAt_VZ = now;
  rawButtonState_M1 = lastButtonState_M1; rawButtonChangedAt_M1 = now;
  rawButtonState_PT = lastButtonState_PT; rawButtonChangedAt_PT = now;
}

// ========== LEITURA DOS BOTÃ•ES FÃSICOS (NÃ£o bloqueante) ==========
void Button_geral() {
  if ((millis() - ultimoComandoRemoto) < 1500) return;
  if (faz_bt_seg != 0) return;

  // Para motores: comportamento "dead-man switch"
  // - Pressionou (LOW): liga e fica ligado enquanto estiver pressionado
  // - Soltou (HIGH): desliga
  // - Enquanto pressionado, renova o timeout para nao cair em TIMEOUT
  auto readMotorButton = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg, bool &estadoMotor, int relayPin, bool locked, const char* lockedReason, unsigned long &ultimoCmdMs) {
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;

    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      if (locked) {
        Serial.print("Comando "); Serial.print(msg); Serial.print(" bloqueado ("); Serial.print(lockedReason); Serial.println(")");
        if (lockedReason && String(lockedReason) == "limite") {
          Serial.print("[LIMIT] IGNORE="); Serial.print(ignoreLimitLocks ? "1" : "0");
          Serial.print(" ENC="); Serial.print(incoder_virtual_encosto_service);
          Serial.print(" ASS="); Serial.print(incoder_virtual_asento_service);
          Serial.print(" PER="); Serial.println(incoder_virtual_perneira_service);
        } else if (lockedReason && String(lockedReason) == "gaveta") {
          Serial.println("[GAVETA] Aberta - perneira bloqueada");
        }
      }
      if (!locked) {
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", msg, false);
      }
    }

    if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "STOP", false);
    }

    if (currentState == LOW && !locked) {
      ultimoCmdMs = millis();
      if (!estadoMotor) {
        estadoMotor = true;
        setOutputPin(relayPin, true, msg);
        Serial.print("Comando "); Serial.print(msg); Serial.println(" acionado");
      }
    } else {
      if (estadoMotor) {
        estadoMotor = false;
        setOutputPin(relayPin, false, msg);
      }
    }

