joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
    stableState = currentState;
  };

  // Para botoes de toggle (ex: refletor)
  auto readToggleButton = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg, bool &toggleVar, int relayPin) {
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;

    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      toggleVar = !toggleVar;
      setOutputPin(relayPin, toggleVar, msg);
      Serial.print("Comando "); Serial.print(msg); Serial.println(" acionado");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", msg, false);
    } else if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
    }
    stableState = currentState;
  };

  auto readInputOnly = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg) {
    if (pin < 0) {
      return;
    }
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;
    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      if (String(msg) == "GAVETA") {
        enviarBLE("GAVETA:OPEN");
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
        mqttStatusDirty = true;
      }
    } else if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
      if (String(msg) == "GAVETA") {
        enviarBLE("GAVETA:CLOSED");
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_CLOSED", false);
        mqttStatusDirty = true;
      }
    }
    stableState = currentState;
  };

  if (rfHabilitado) {
    readToggleButton(RF, lastButtonState_RF, rawButtonState_RF, rawButtonChangedAt_RF, "RF", estado_r, Rele_refletor);
  }
  readInputOnly(GAVETA, lastButtonState_GAVETA, rawButtonState_GAVETA, rawButtonChangedAt_GAVETA, "GAVETA");
  bool gavetaAberta = isGavetaAberta();
  readMotorButton(SP, lastButtonState_SP, rawButtonState_SP, rawButtonChangedAt_SP, "SP", estado_sp, Rele_SP, (!ignoreLimitLocks && trava_bt_SP) || gavetaAberta, gavetaAberta ? "gaveta" : "limite", ultimoComandoSP);
  readMotorButton(DP, lastButtonState_DP, rawButtonState_DP, rawButtonChangedAt_DP, "DP", estado_dp, Rele_DP, (!ignoreLimitLocks && trava_bt_DP) || gavetaAberta, gavetaAberta ? "gaveta" : "limite", ultimoComandoDP);
  readMotorButton(DE, lastButtonState_DE, rawButtonState_DE, rawButtonChangedAt_DE, "DE", estado_de, Rele_DE, !ignoreLimitLocks && trava_bt_DE, "limite", ultimoComandoDE);
  readMotorButton(SE, lastButtonState_SE, rawButtonState_SE, rawButtonChangedAt_SE, "SE", estado_se, Rele_SE, !ignoreLimitLocks && trava_bt_SE, "limite", ultimoComandoSE);
  readMotorButton(SA, lastButtonState_SA, rawButtonState_SA, rawButtonChangedAt_SA, "SA", estado_sa, Rele_SA, !ignoreLimitLocks && trava_bt_SA, "limite", ultimoComandoSA);
  readMotorButton(DA, lastButtonState_DA, rawButtonState_DA, rawButtonChangedAt_DA, "DA", estado_da, Rele_DA, !ignoreLimitLocks && trava_bt_DA, "limite", ultimoComandoDA);

  // Botões de funções especiais (VZ, M1, PT)
  {
    uint32_t now = millis();
    bool currRaw = digitalRead(VZ);
    if (currRaw != rawButtonState_VZ) {
      rawButtonState_VZ = currRaw;
      rawButtonChangedAt_VZ = now;
    }
    if ((now - rawButtonChangedAt_VZ) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_VZ;
      if (curr == LOW && lastButtonState_VZ == HIGH) {
        Serial.print("[GPIO_INT] Botao VZ (Pino "); Serial.print(VZ); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando VZ acionado");
        cont = 1;
        executa_vz();
      } else if (curr == HIGH && lastButtonState_VZ == LOW) {
        Serial.print("[GPIO_INT] Botao VZ (Pino "); Serial.print(VZ); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_VZ = curr;
    }
  }

  {
    uint32_t now = millis();
    bool currRaw = digitalRead(M1);
    if (currRaw != rawButtonState_M1) {
      rawButtonState_M1 = currRaw;
      rawButtonChangedAt_M1 = now;
    }
    if ((now - rawButtonChangedAt_M1) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_M1;
      if (curr == LOW && lastButtonState_M1 == HIGH) {
        Serial.print("[GPIO_INT] Botao M1 (Pino "); Serial.print(M1); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando M1 acionado");
        executa_M1();
      } else if (curr == HIGH && lastButtonState_M1 == LOW) {
        Serial.print("[GPIO_INT] Botao M1 (Pino "); Serial.print(M1); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_M1 = curr;
    }
  }

  {
    uint32_t now = millis();
    bool currRaw = digitalRead(PT);
    if (currRaw != rawButtonState_PT) {
      rawButtonState_PT = currRaw;
      rawButtonChangedAt_PT = now;
    }
    if ((now - rawButtonChangedAt_PT) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_PT;
      if (curr == LOW && lastButtonState_PT == HIGH) {
        Serial.print("[GPIO_INT] Botao PT (Pino "); Serial.print(PT); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando PT acionado");
        cont13 = 1;
        executa_pt();
      } else if (curr == HIGH && lastButtonState_PT == LOW) {
        Serial.print("[GPIO_INT] Botao PT (Pino "); Serial.print(PT); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_PT = curr;
    }
  }
}

void iniciaCalibracaoSeNecessario() {
  Preferences p;
  p.begin("cadeira", false);
  bool done = p.getBool("cal_done", false);
  p.end();
  if (!done) {
    executaCalibracao();
  }
}

