joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
void executaCalibracao() {
  Serial.println("\n=== CALIBRACAO AUTOMATICA (primeira vez) ===");
  Serial.println("Indo para zero (VZ) por 15 segundos...");
  calibrationInProgress = true;
  incoder_virtual_encosto_service = 0;
  incoder_virtual_asento_service = 0;
  incoder_virtual_perneira_service = 0;
  pulses_encosto = pulses_assento = pulses_perneira = 0;
  last_pulses_encosto = last_pulses_assento = last_pulses_perneira = 0;
  contador2 = 0;
  cont = 1;
  executa_vz();
  setOutputPin(Rele_SE, false, "CAL");
  setOutputPin(Rele_DE, false, "CAL");
  setOutputPin(Rele_DA, false, "CAL");
  setOutputPin(Rele_SA, false, "CAL");
  setOutputPin(Rele_DP, false, "CAL");
  setOutputPin(Rele_SP, false, "CAL");
  delay(200);
  Serial.println("Subindo todos os eixos ate limite (aprendizado)...");
  unsigned long start = millis();
  bool doneEnc = false, doneAss = false, donePer = false;
  bool errEnc = false, errAss = false, errPer = false;
  bool sawEnc = false, sawAss = false, sawPer = false;
  unsigned long lastChangeEnc = millis(), lastChangeAss = millis(), lastChangePer = millis();
  unsigned long startEnc = millis(), startAss = millis(), startPer = millis();
  uint32_t startPulseEnc = pulses_encosto, startPulseAss = pulses_assento, startPulsePer = pulses_perneira;
  uint32_t prevPulseEnc = startPulseEnc, prevPulseAss = startPulseAss, prevPulsePer = startPulsePer;
  setOutputPin(Rele_DE, true, "CAL");
  setOutputPin(Rele_SA, true, "CAL");
  setOutputPin(Rele_SP, true, "CAL");
  while (!(doneEnc && doneAss && donePer) && (millis() - start) < 30000) {
    uint32_t pe = pulses_encosto, pa = pulses_assento, pp = pulses_perneira;
    contagem_tempo_incoder_virtual();
    if (!doneEnc) {
      if (pe != prevPulseEnc) {
        lastChangeEnc = millis();
        sawEnc = true;
        prevPulseEnc = pe;
      }
      if ((millis() - startEnc > 2000) && !sawEnc) {
        setOutputPin(Rele_DE, false, "CAL");
        doneEnc = true;
        errEnc = true;
        for (int i=0;i<3;i++){ bip(); delay(120);} delay(200); for (int i=0;i<3;i++){ bip(); delay(120);}
        Serial.println("[ERRO CAL] Encosto: sem pulsos do encoder. Verifique ligacao.");
      } else if (sawEnc && millis() - lastChangeEnc > 500) {
        setOutputPin(Rele_DE, false, "CAL");
        doneEnc = true;
        Serial.print("Encosto max = "); Serial.println(incoder_virtual_encosto_service);
      }
    }
    if (!doneAss) {
      if (pa != prevPulseAss) {
        lastChangeAss = millis();
        sawAss = true;
        prevPulseAss = pa;
      }
      if ((millis() - startAss > 2000) && !sawAss) {
        setOutputPin(Rele_SA, false, "CAL");
        doneAss = true;
        errAss = true;
        for (int i=0;i<3;i++){ bip(); delay(120);} delay(200); for (int i=0;i<3;i++){ bip(); delay(120);}
        Serial.println("[ERRO CAL] Assento: sem pulsos do encoder. Verifique ligacao.");
      } else if (sawAss && millis() - lastChangeAss > 500) {
        setOutputPin(Rele_SA, false, "CAL");
        doneAss = true;
        Serial.print("Assento max = "); Serial.println(incoder_virtual_asento_service);
      }
    }
    if (!donePer) {
      if (pp != prevPulsePer) {
        lastChangePer = millis();
        sawPer = true;
        prevPulsePer = pp;
      }
      if ((millis() - startPer > 2000) && !sawPer) {
        setOutputPin(Rele_SP, false, "CAL");
        donePer = true;
        errPer = true;
        for (int i=0;i<3;i++){ bip(); delay(120);} delay(200); for (int i=0;i<3;i++){ bip(); delay(120);}
        Serial.println("[ERRO CAL] Perneira: sem pulsos do encoder. Verifique ligacao.");
      } else if (sawPer && millis() - lastChangePer > 500) {
        setOutputPin(Rele_SP, false, "CAL");
        donePer = true;
        Serial.print("Perneira max = "); Serial.println(incoder_virtual_perneira_service);
      }
    }
    delay(10);
  }
  setOutputPin(Rele_DE, false, "CAL");
  setOutputPin(Rele_SA, false, "CAL");
  setOutputPin(Rele_SP, false, "CAL");
  calibrationInProgress = false;
  if (errEnc || errAss || errPer) {
    Serial.println("[ERRO CAL] Calibracao incompleta. Pelo menos um encoder nao gerou pulsos.");
    for (int i=0;i<5;i++){ bip(); delay(120);}
  } else {
    Preferences p;
    p.begin("cadeira", false);
    p.putInt("encosto_max", incoder_virtual_encosto_service);
    p.putInt("assento_max", incoder_virtual_asento_service);
    p.putInt("perneira_max", incoder_virtual_perneira_service);
    p.putBool("cal_done", true);
    p.end();
    fim_encosto_encoder = incoder_virtual_encosto_service;
    fim_asento_encoder = incoder_virtual_asento_service;
    fim_perneira_encoder = incoder_virtual_perneira_service;
    trava_bt_DE = true;
    trava_bt_SA = true;
    trava_bt_SP = true;
    trava_bt_SE = false;
    trava_bt_DA = false;
    trava_bt_DP = false;
    Serial.println("[OK] Calibracao concluida e salva.");
  }
}

// ========== EXECUÃ‡ÃƒO DA POSIÃ‡ÃƒO GINECOLÃ“GICA (VZ) ==========
void executa_vz() {
  Serial.println("VZ acionado");
  bip();

  bool checkEnc = (fim_encosto_encoder == 0 && fim_asento_encoder == 0 && fim_perneira_encoder == 0);
  int startEncPos = incoder_virtual_encosto_service;
  int startAssPos = incoder_virtual_asento_service;
  int startPerPos = incoder_virtual_perneira_service;
  bool canEarlyFinish = (startEncPos != 0 || startAssPos != 0 || startPerPos != 0);
  uint32_t startPulseEnc = pulses_encosto;
  uint32_t startPulseAss = pulses_assento;
  uint32_t startPulsePer = pulses_perneira;
  uint32_t startTime = millis();
  Serial.print("[VZ] TIMEOUT_MS=");
  Serial.print(VZ_MAX_TIME_MS);
  Serial.print(" START ENC=");
  Serial.print(startEncPos);
  Serial.print(" ASS=");
  Serial.print(startAssPos);
  Serial.print(" PER=");
  Serial.print(startPerPos);
  Serial.print(" ENC_CHECK=");
  Serial.println(checkEnc ? "1" : "0");

  setOutputPin(Rele_DA, true, "VZ");
  delay(250);
  setOutputPin(Rele_SE, true, "VZ");
  delay(250);
  setOutputPin(Rele_DP, true, "VZ");

  Serial.println("Executando VZ");
  faz_bt_seg = 1;

