joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
    // Proteção contra overflow (15 segundos = 15000ms)
    if (contador >= 15000 || contador < 0) {
      setOutputPin(Rele_SA, false, "PT");
      setOutputPin(Rele_DE, false, "PT");
      setOutputPin(Rele_SP, false, "PT");
      cont13 = 0;
      contador = 0;

      bip();
      faz_bt_seg = 0;
      Serial.println("Fim PT");
      enviarBLE("PT:DONE");
    }
  }
}

// ========== EXECUÃ‡ÃƒO DA MEMÃ“RIA M1 (via botÃ£o fÃ­sico) ==========
void executa_M1() {
  buttonState = digitalRead(M1);
  while (buttonState == LOW) {
    buttonState = digitalRead(M1);
    cont12++;

    if (cont12 < 500) {
      Serial.println("Contando tempo botao Memoria 1");
      Serial.print("cont12 = ");
      Serial.println(cont12);
    } else {
      Serial.println("Executando M1");
      faz_m1 = true;
      bip();
      delay(200);
      bip();
      delay(200);
      cont12 = 0;

      Serial.println("Executando Memoria 1");
      Serial.print("Posicao do encosto = ");
      Serial.println(incoder_virtual_encosto_service);
      Serial.print("Posicao do assento = ");
      Serial.println(incoder_virtual_asento_service);
      Serial.print("Posicao da perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    }
  }

  cont12 = 0;

  // Se pressionou rÃ¡pido, salva a posiÃ§Ã£o atual
  if (faz_m1 == false) {
    incoder_virtual_encosto_M1 = incoder_virtual_encosto_service;
    incoder_virtual_asento_M1 = incoder_virtual_asento_service;
    incoder_virtual_perneira_M1 = incoder_virtual_perneira_service;

    preferences.begin("encoder_encosto", false);
    preferences.putInt("encoder_encosto", incoder_virtual_encosto_M1);
    preferences.end();
    
    preferences.begin("encoder_asento", false);
    preferences.putInt("encoder_asento", incoder_virtual_asento_M1);
    preferences.end();
    
    preferences.begin("encoder_perneira", false);
    preferences.putInt("encoder_perneira", incoder_virtual_perneira_M1);
    preferences.end();

    Serial.println("Posicoes de memoria gravadas");
    Serial.print("Posicao do encosto na memoria = ");
    Serial.println(incoder_virtual_encosto_M1);
    Serial.print("Posicao do assento na memoria = ");
    Serial.println(incoder_virtual_asento_M1);
    Serial.print("Posicao da perneira na memoria = ");
    Serial.println(incoder_virtual_perneira_M1);

    enviarBLE("M1:SAVED");
    supabaseSaveMemoryPosition(1);

    bip();
    delay(200);
    bip();
  }

  // Se segurou o botÃ£o, executa o movimento para a posiÃ§Ã£o salva
  while (faz_m1 == true) {
    Watch_Dog();

    faz_bt_seg = 1;
    Button_Seg();

    if (faz_bt_seg == 0) {
      bip();
      delay(700);
      bip();
      faz_m1 = false;
      return;
    }

    // Movimento do Encosto
    if (incoder_virtual_encosto_service > incoder_virtual_encosto_M1) {
      setOutputPin(Rele_DE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service--;
      Serial.print("Posicao encoder virtual encosto = ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_DE, false, "M1");
      en_DE_acabou = true;
    }

    if (incoder_virtual_encosto_service < incoder_virtual_encosto_M1) {
      setOutputPin(Rele_SE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service++;
      Serial.print("Posicao encoder virtual encosto = ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_SE, false, "M1");
      en_SE_acabou = true;
    }

    // Movimento do Assento
    if (incoder_virtual_asento_service > incoder_virtual_asento_M1) {
      setOutputPin(Rele_DA, true, "M1");
      delay(250);
      incoder_virtual_asento_service--;
      Serial.print("Posicao encoder virtual assento = ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_DA, false, "M1");
      en_DA_acabou = true;
    }

    if (incoder_virtual_asento_service < incoder_virtual_asento_M1) {
      setOutputPin(Rele_SA, true, "M1");
      delay(250);
      incoder_virtual_asento_service++;
      Serial.print("Posicao encoder virtual assento = ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_SA, false, "M1");
      en_SA_acabou = true;
    }

    // Movimento da Perneira
    if (incoder_virtual_perneira_service > incoder_virtual_perneira_M1) {
      setOutputPin(Rele_DP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service--;
      Serial.print("Posicao encoder virtual perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_DP, false, "M1");
      en_DP_acabou = true;
    }

    if (incoder_virtual_perneira_service < incoder_virtual_perneira_M1) {
      setOutputPin(Rele_SP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service++;
      Serial.print("Posicao encoder virtual perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_SP, false, "M1");
      en_SP_acabou = true;
    }

    // Verifica se todos os movimentos terminaram
    if (en_SE_acabou == true && en_DE_acabou == true && en_SA_acabou == true && en_DA_acabou == true && en_SP_acabou == true && en_DP_acabou == true) {
      faz_m1 = false;
      en_SP_acabou = false;
      en_DP_acabou = false;
      en_SE_acabou = false;
      en_DE_acabou = false;
      en_SA_acabou = false;
      en_DA_acabou = false;

      bip();
      delay(500);
      bip();

      Serial.println("Fim do movimento da memoria 1");
      enviarBLE("M1:DONE");
      return;
    }
  }
}

// ========== PARADA DE EMERGÃŠNCIA (AT_SEG) ==========
void AT_SEG() {
  if (faz_bt_seg == 1) {
    Serial.println("Parando todos os movimentos");
    enviarBLE("AT_SEG:STOPPING");

    setOutputPin(Rele_DE, false, "AT_SEG");
    setOutputPin(Rele_SE, false, "AT_SEG");
    setOutputPin(Rele_SA, false, "AT_SEG");
    setOutputPin(Rele_DA, false, "AT_SEG");
    setOutputPin(Rele_SP, false, "AT_SEG");
    setOutputPin(Rele_DP, false, "AT_SEG");
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "AT_SEG");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "AT_SEG");

    // Atualiza estados
    estado_de = false;
    estado_se = false;
    estado_sa = false;
    estado_da = false;
    estado_sp = false;
    estado_dp = false;
    estado_trend_sobe = false;
    estado_trend_desce = false;

    faz_bt_seg = 0;
    cont = 0;
    cont13 = 0;
  }
  delay(100);
}

// ========== BIP (buzzer) ==========
void bip() {
  digitalWrite(BUZZER, HIGH);
  delay(100);
  digitalWrite(BUZZER, LOW);
}

// ========== MONITORAMENTO DO SISTEMA (DEBUG) ==========
void monitoraSistema() {
  if (millis() - ultimoMonitoramentoSistema < INTERVALO_MONITORAMENTO) return;
  ultimoMonitoramentoSistema = millis();

  Serial.println("--- MONITORAMENTO DO SISTEMA ---");
  Serial.print("Free Heap: "); Serial.print(ESP.getFreeHeap() / 1024); Serial.println(" KB");
  Serial.print("Min Free Heap: "); Serial.print(ESP.getMinFreeHeap() / 1024); Serial.println(" KB");
  Serial.print("WiFi Status: "); 
  switch(WiFi.status()) {
    case WL_CONNECTED: Serial.println("CONECTADO"); break;
    case WL_DISCONNECTED: Serial.println("DESCONECTADO"); break;
    case WL_CONNECTION_LOST: Serial.println("CONEXAO PERDIDA"); break;
    default: Serial.println(WiFi.status()); break;
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("IP: "); Serial.println(WiFi.localIP());
    Serial.print("RSSI: "); Serial.println(WiFi.RSSI());
  }
#if HAS_BLE
  Serial.print("BLE Status: "); 
  Serial.println(bleClienteConectado ? "CONECTADO" : "AGUARDANDO CONEXAO");
  if (bleClienteConectado && pServer != NULL) {
    Serial.print("BLE Clientes: "); 
    Serial.println(pServer->getConnectedCount());
  }
#else
  Serial.println("BLE Status: NA");
#endif
  Serial.print("Horimetro: "); Serial.println(horimetro);
  Serial.print("Cadeira Habilitada: "); Serial.println(cadeiraHabilitada ? "SIM" : "NAO");
  Serial.print("MQTT Status: ");
  bool mqttConnected = mqttClient.connected();
  String hostSnapshot;
  uint16_t portSnapshot = 0;
  bool tlsSnapshot = false;
  String clientIdSnapshot;
  bool cleanSnapshot = true;
  if (mqttLockMs(20)) {
    hostSnapshot = mqttHost;
    portSnapshot = mqttPort;
    tlsSnapshot = mqttUseTls;
    clientIdSnapshot = mqttClientId;
    cleanSnapshot = mqttCleanSession;
    mqttUnlock();
  } else {
    hostSnapshot = mqttHost;
    portSnapshot = mqttPort;
    tlsSnapshot = mqttUseTls;
    clientIdSnapshot = mqttClientId;
    cleanSnapshot = mqttCleanSession;
  }
  Serial.print(mqttConnected ? "CONECTADO " : "DESCONECTADO ");
  Serial.print("HOST=");
  Serial.print(hostSnapshot);
  Serial.print(" PORT=");
  Serial.print(portSnapshot);
  Serial.print(" TLS=");
  Serial.println(tlsSnapshot ? "SIM" : "NAO");
  Serial.print("MQTT CLIENT_ID: ");
  Serial.println(clientIdSnapshot.length() > 0 ? clientIdSnapshot : ("ESP32-" + NUMERO_SERIE_CADEIRA));
  Serial.print("MQTT CLEAN: ");
  Serial.println(cleanSnapshot ? "1" : "0");
  Serial.print("MQTT RX: "); Serial.print(mqttRxCount);
  Serial.print(" TX: "); Serial.println(mqttTxCount);
  if (mqttLastRxMs) {
    Serial.print("Ultimo MQTT RX: ");
    Serial.print((millis() - mqttLastRxMs) / 1000);
    Serial.println("s");
  }
  if (mqttLastTxMs) {
    Serial.print("Ultimo MQTT TX: ");
    Serial.print((millis() - mqttLastTxMs) / 1000);
    Serial.println("s");
  }
  
  // Contadores de tempo para próximas atualizações
  unsigned long tempoAtual = millis();
  unsigned long tempoAteProximoHorimetro = 0;
  unsigned long tempoAteProximaVerificacao = 0;
  
  if (tempoAtual - ultimaAtualizacaoSupabase < INTERVALO_ATUALIZACAO_SUPABASE) {
    tempoAteProximoHorimetro = (INTERVALO_ATUALIZACAO_SUPABASE - (tempoAtual - ultimaAtualizacaoSupabase)) / 1000;
  }
  
  if (tempoAtual - ultimaVerificacaoStatus < INTERVALO_VERIFICACAO_STATUS) {
    tempoAteProximaVerificacao = (INTERVALO_VERIFICACAO_STATUS - (tempoAtual - ultimaVerificacaoStatus)) / 1000;
  }
  
  Serial.print("Proximo envio horimetro: "); Serial.print(tempoAteProximoHorimetro); Serial.println("s");
  Serial.print("Proxima verificacao status: "); Serial.print(tempoAteProximaVerificacao); Serial.println("s");
  
#if USE_PCF8574
  // Removido a impressao constante daqui
#endif

  Serial.println("--------------------------------");
}

